import inspect 
from ctypes import memmove, memset
import dis
ⅉｊĳjⅉｊiǉiⅉǉjĳlJlĳĲĲjḬĲḬⅉⅉḬĲｊi: int = ((3589665339713*((0*(332 ^ 142)+1*(~(332 | 142))+-1*(~142)+0*(332 | ~142)+1*(332 & ~142))+(35796839490390681))+(1685549179980))%2**44)
class iiiḬḬIḬÎIÎljĳǉｊIÎｊĳiⅉĲIÎIjjjĴǉ:
    def __init__(
        self,
        ḬⅉIⅉĲĳĳĳǉlĴĲǉJⅉJlĴĳjiǉǉĴJlÎiIĴ,
        ĴÎlⅉIiḬIIⅉIĲĴJÎĴiIiⅉlĳIJiⅉÎjĲI,
        ǉǉḬĲĳｊlĴiǉjⅉJḬlⅉⅉÎiĳĴIjJÎḬḬḬǉi,
        ĲjĲⅉiÎⅉⅉjiĴḬJjiĴĳlｊĳÎｊlĳǉĳĳĳjǉ,
        ĳǉlǉǉlḬIlｊḬǉｊÎjÎIĳｊlĳÎĳⅉiljÎÎĳ,
        ĲⅉⅉĲḬĴⅉｊJiｊIIǉĲĲｊｊIĳJĲIｊḬĲĴĳｊJ,
        IǉljḬIÎIｊlĴĲĴĲljⅉIjĳJĴIjǉÎIĴĴi
    ):
        """
        Our VM entry
        """
        ⅉｊĲliiḬJÎÎiⅉIiÎiḬｊḬǉĳĴĴĲｊｊiĲⅉĲ: int = ((11953755278830857995105*((-2*(651 & 723)+1*(~651)+-1*(651 ^ 723)+-1*(~723)+2*(651))+(105268642867321910497770338))+(16663973112539408120995))%2**74)
        self.stack = [] 
        self.opname_map = ḬⅉIⅉĲĳĳĳǉlĴĲǉJⅉJlĴĳjiǉǉĴJlÎiIĴ
        ḬｊĲIǉJĲǉĳiǉḬIḬｊIiĴIlⅉJǉÎjÎJḬĲj: int = ((3123944135*((1*(~(644 | 699))+0*(~(644 ^ 699))+-1*(~(644 & 699))+0*(699)+1*(644 ^ 699))+(32408975284939))+(906342537))%2**32)
        self.vm_globals = ĴÎlⅉIiḬIIⅉIĲĴJÎĴiIiⅉlĳIJiⅉÎjĲI
        self.vm_locals = ǉǉḬĲĳｊlĴiǉjⅉJḬlⅉⅉÎiĳĴIjJÎḬḬḬǉi
        self.names = ĲjĲⅉiÎⅉⅉjiĴḬJjiĴĳlｊĳÎｊlĳǉĳĳĳjǉ
        ĲIjjĲⅉjÎĳIĳĲⅉḬⅉǉljIĲlĴĴÎĴĴḬĲiǉ: int = ((3534097181409519093*((-1*(~649 & 709)+-1*(~(649 | 709))+0*(-1)+-1*(649 & 709)+1*(~649 | 709))+(4507489487818445157054))+(1216234294560967389))%2**62)
        self.consts = ĳǉlǉǉlḬIlｊḬǉｊÎjÎIĳｊlĳÎĳⅉiljÎÎĳ
        self.varnames = ĲⅉⅉĲḬĴⅉｊJiｊIIǉĲĲｊｊIĳJĲIｊḬĲĴĳｊJ
        self.varnames_map = {ĳｊĴĴlǉĲjĳiǉiĳḬĳĲǉlijIiǉĲĲÎĳⅉḬI: None for ĳｊĴĴlǉĲjĳiǉiĳḬĳĲǉlijIiǉĲĲÎĳⅉḬI in self.varnames}
        ḬĴIiĴÎiÎÎｊⅉĳIĴǉJĳḬiĲǉJiĴÎIǉⅉĳÎ: int = ((131957940352646362491354788953*((1*(~929 | 236)+1*(~929 & 236)+-1*(~929)+-1*(236)+0*(929 ^ 236))+(11517752773673581508723664037567))+(70335298850201066419574357008))%2**97)
        self.bytecode = IǉljḬIÎIｊlĴĲĴĲljⅉIjĳJĴIjǉÎIĴĴi
        IlǉĲⅉjĳĴĳJÎĲǉḬIjĳĴĴǉḬḬĴllĴĴǉiJ: int = ((48309164093*((-1*(755)+1*(755 & ~989)+1*(755 | 989)+-1*(755 ^ 989))+(127168490050983))+(63020170155))%2**37)
        self.idx = ((10921846590720771511349*((-1*(~(703 & 768))+0*(~768)+1*(~703)+0*(~(703 ^ 768))+1*(703 & ~768))+(6485085934588231566343))+(35515968970674715467405))%2**75)
        self.cont = True
        ḬⅉⅉIḬḬÎĴĴJÎⅉJĳǉḬⅉlĲĴǉⅉjĴlÎJjil: int = ((1067933267597*((-1*(-1)+0*(~(688 & 483))+1*(~483)+0*(~(688 | 483))+1*(483))+(430352349054337))+(2039558821521))%2**41)
        ĳJĳĴjiJlǉḬḬJJḬⅉÎĴĴĳiÎĲĴḬjIĳlǉǉ: int = ((1189373247953007*((-1*(~448 & 244)+-1*(448)+1*(448 | 244)+0*(244)+0*(~448 | 244))+(4591407745122093203))+(7360181099582962))%2**53)
        ĳjĴĴÎJÎĳⅉⅉlḬlĳḬⅉIiĴjjĳjｊlḬĴĳǉJ: int = ((26193222323912747*((0*(368 & 15)+0*(368 | ~15)+-1*(~(368 | 15))+-1*(368 ^ 15)+1*(~(368 & 15)))+(404976933873894001179))+(55948223396620710))%2**56)
        self.ret = None
        self.debug = True
        lḬｊḬljĴjJjĴIĲǉĴJĴǉlǉǉⅉⅉⅉIIlIǉǉ: int = ((7787660323685136122080043*((0*(845)+-1*(~(845 & 948))+-1*(845 | 948)+2*(845 ^ 948)+1*(~(845 ^ 948)))+(23630310398733729069106007292))+(2848860517937552582352624))%2**83)
        for JｊIÎｊĳiḬjⅉⅉlIḬĳｊĲǉIjǉlǉjIJĳǉǉｊ, ÎlĲjjĲĳĳJlĳJĲĳiⅉijiｊIǉǉIiｊĴḬĲl in ǉǉḬĲĳｊlĴiǉjⅉJḬlⅉⅉÎiĳĴIjJÎḬḬḬǉi.items():
            if JｊIÎｊĳiḬjⅉⅉlIḬĳｊĲǉIjǉlǉjIJĳǉǉｊ in self.varnames_map:
                self.varnames_map[JｊIÎｊĳiḬjⅉⅉlIḬĳｊĲǉIjǉlǉjIJĳǉǉｊ] = ÎlĲjjĲĳĳJlĳJĲĳiⅉijiｊIǉǉIiｊĴḬĲl
        #HACK: there's definitely a smarter way to do this
        for iIǉjiJⅉⅉÎⅉĴjｊǉḬIⅉĳijIÎǉjjｊｊĳĴI, ĳḬǉⅉⅉĳllⅉḬĳIĴĴĲjⅉiĴĲⅉĲǉJĲjĳｊiĳ in ĴÎlⅉIiḬIIⅉIĲĴJÎĴiIiⅉlĳIJiⅉÎjĲI.items():
            self.varnames_map[iIǉjiJⅉⅉÎⅉĴjｊǉḬIⅉĳijIÎǉjjｊｊĳĴI] = ĳḬǉⅉⅉĳllⅉḬĳIĴĴĲjⅉiĴĲⅉĲǉJĲjĳｊiĳ
        IIJǉḬĲÎliiĲⅉÎĴĲĲǉǉjḬĳⅉĴÎĴǉĳǉji: int = ((6394500040699097365567557*((-1*(285)+0*(-1)+2*(~336 & 285)+-1*(~336)+1*(~(336 ^ 285)))+(57534686749067227727596103295))+(4973446625147835244419681))%2**83)
        ⅉĴｊⅉĳⅉｊĲĴǉḬÎḬĲḬiĲḬiĳjIIⅉｊĴIIｊl: int = ((489773489058781568686062189*((-1*(~(326 & 416))+0*(~(326 | 416))+0*(326 | ~416)+1*(~326)+1*(326 & ~416))+(1885219173433744678667336011551))+(127466279658617370338860858))%2**89)
        if self.debug:
            print(f"stack: {self.stack}")
            print(f"vm_globals: {self.vm_globals}")
            print(f"vm_locals: {self.vm_locals}")
            print(f"names: {self.names}")
            print(f"consts: {self.consts}")
            print(f"varnames: {self.varnames}")
            print(f"varnames_map: {self.varnames_map}")
    
    def run(self):
        ĴǉÎiĲｊJĲJĴĴĳĴｊⅉIｊJĲĳjḬǉlÎⅉjḬIⅉ: int = ((53208105679900625796187*((0*(515 | ~869)+1*(~(515 & 869))+-1*(515 ^ 869)+-1*(~(515 | 869)))+(7748385611760240494284547))+(679537943003988113000))%2**76)
        jIjjｊǉIḬĴĴÎĳIĴĲIÎllĴÎlｊiÎiIJIj: int = ((1275407443371*((-1*(~(420 ^ 387))+1*(-1)+-1*(420 ^ 387)+0*(~420 & 387))+(4628773019602113))+(1225221468294))%2**41)
        ÎjĲⅉｊÎĳiⅉĲⅉiÎÎÎjĴĲjIiJĳlĴJḬĲIĳ: int = ((307856523796630607*((-1*(706)+-1*(580)+2*(580 | 706)+-1*(580 ^ 706))+(6759372817447888486739))+(2165509073887296176))%2**62)
        while self.cont is True:
            if self.debug:
                print("="*((2982929939789792396591*((-2*(241)+-1*(~241)+-1*(277)+1*(~(277 ^ 241))+2*(277 | 241))+(70365947847098139583306))+(941525983098209964926))%2**72))
                print(f"stack: {self.stack}")
                print(f"vm_globals: {self.vm_globals}")
                print(f"vm_locals: {self.vm_locals}")
                print(f"names: {self.names}")
                print(f"consts: {self.consts}")
                print(f"varnames: {self.varnames}")
                print(f"varnames_map: {self.varnames_map}")
            iiliJⅉjḬǉĳIǉiḬilIĲĲǉĴḬjJJĴǉJIÎ = self.bytecode[self.idx]
            ｊiljĲĴｊĳĲĲÎĳliJIĳÎIiJĳǉĴIÎlĲiｊ = self.bytecode[self.idx+((1860843*((0*(297)+-1*(297 & ~370)+1*(-1)+-1*(~297 | 370))+(1717056))+(914497))%2**21)]
            # Just using opcode map for now, we can hide this later 
            ǉjJiÎjĲĳĳlĴĲḬÎJḬⅉĳǉḬjĳｊjÎlḬÎⅉi = self.opname_map[str(iiliJⅉjḬǉĳIǉiḬilIĲĲǉĴḬjJJĴǉJIÎ)]
            ĳḬｊJḬⅉIĴĲjÎIIｊǉiIilĲJḬĳǉĴĲĲｊIĳ = f"handle_{ǉjJiÎjĲĳĳlĴĲḬÎJḬⅉĳǉḬjĳｊjÎlḬÎⅉi.lower()}"              
            if self.debug:
                print(f"jarg_opcode: {iiliJⅉjḬǉĳIǉiḬilIĲĲǉĴḬjJJĴǉJIÎ} jarg_arg: {ｊiljĲĴｊĳĲĲÎĳliJIĳÎIiJĳǉĴIÎlĲiｊ}")
                print(f"py_opname: {ǉjJiÎjĲĳĳlĴĲḬÎJḬⅉĳǉḬjĳｊjÎlḬÎⅉi}")
                print(f"handler_name: {ĳḬｊJḬⅉIĴĲjÎIIｊǉiIilĲJḬĳǉĴĲĲｊIĳ}")
            if ｊiljĲĴｊĳĲĲÎĳliJIĳÎIiJĳǉĴIÎlĲiｊ == ((60959346403639*((-1*(~901)+-1*(901)+0*(~(801 | 901))+1*(-1)+0*(~801))+(44180817340825754))+(18485720103459))%2**46):
                getattr(self, ĳḬｊJḬⅉIĴĲjÎIIｊǉiIilĲJḬĳǉĴĲĲｊIĳ)()
            else:
                # we have an argument
                getattr(self, ĳḬｊJḬⅉIĴĲjÎIIｊǉiIilĲJḬĳǉĴĲĲｊIĳ)(ｊiljĲĴｊĳĲĲÎĳliJIĳÎIiJĳǉĴIÎlĲiｊ)
            if self.debug:
                print("="*((82585214709526242389705721485*((-1*(149 & 51)+-1*(~149)+1*(~(149 ^ 51))+0*(149 | ~51)+1*(~149 & 51))+(6520359323583298546878986843597))+(118512160348456722441255211051))%2**99))
            self.idx += ((571334037784322015925*((-1*(792)+1*(~467)+1*(467)+-1*(~792))+(963306283820476644869))+(256919246030884576377))%2**69)
        ÎĴĳǉlǉÎlǉⅉｊJḬḬḬjｊǉIJjÎIĳÎⅉjĲǉḬ: int = ((170823656048119*((0*(~(610 ^ 925))+-1*(610 & 925)+-1*(~925)+0*(~610 & 925)+1*(610 | ~925))+(175292926350020537))+(109653160953941))%2**50)
        ÎiｊJJｊÎĴⅉiJĳJⅉⅉIǉｊḬⅉⅉÎḬlĳｊĲǉḬÎ: int = ((50030775513757*((-1*(803 ^ 158)+0*(-1)+-1*(803 & 158)+1*(803 | 158))+(34814990965190441))+(49454920406177))%2**47)
        jjｊiIÎJｊｊǉĲḬIÎiJĳｊⅉĲilÎlĲJIjǉⅉ: int = ((6173353888107*((-1*(~511)+1*(511 ^ 54)+-2*(511 | 54)+1*(-1)+1*(54))+(22355389781717685))+(6686502799308))%2**44)
        ǉjǉĲĴḬIJĳÎĴÎJĲĳĴｊIḬĳiÎⅉÎlǉllIⅉ: int = ((46595641653944731878917*((-1*(~(215 | 264))+1*(~215 | 264)+0*(~(215 & 264))+-1*(264))+(57329335483906260915774660))+(165812997036611833697096))%2**78)
        ḬIÎiǉÎⅉｊijḬǉｊjjｊlⅉÎIĴijｊJÎⅉIjｊ: int = ((943463931114554290454607*((2*(145 & 923)+-1*(145 | 923)+1*(~(145 & 923))+-1*(~(145 ^ 923)))+(1436008373823606478306721475))+(955698107599450262862209))%2**81)
        ǉĲiĳiḬilｊÎÎliĴiḬḬiḬlĳǉJĳÎĴǉiｊÎ: int = ((15253598683782521144279*((-1*(603 | 506)+1*(603 & ~506)+0*(~603 & 506)+0*(~603 | 506)+1*(506))+(122978992356873211538338383))+(12409434777157961180199))%2**76)
        ijⅉĴĳｊÎÎĳJⅉǉĴⅉllǉⅉĲĴIjiĳĴĲjlⅉĳ: int = ((302243382571*((1*(~(523 | 343))+-1*(~523)+0*(~343)+0*(523 & 343)+1*(~523 & 343))+(328960043036070))+(1016942598568))%2**40)
        ĲiⅉIḬJIJĳÎiⅉiÎĳｊIiｊiÎIĳJIJĳĳĳｊ: int = ((619939376891749349632209*((0*(~(27 & 605))+-1*(27 & 605)+-1*(~605)+1*(27)+1*(~(27 | 605)))+(136698210351773817787234700))+(1130648126911261325108583))%2**80)
        ⅉJjJÎḬlǉĳllĲⅉIIḬḬĳiĳjｊÎĴiⅉḬḬĳĲ: int = ((17047655919*((-1*(380 & 102)+-1*(~(380 & 102))+1*(~102)+1*(102)+0*(~380 | 102))+(12309058257368))+(6582902308))%2**35)
        ĴǉijiilĳĲlĴḬǉⅉĳJJĴiĲIÎḬǉIĴĴĴji: int = ((4798838597389571*((1*(~(664 | 985))+-1*(664)+1*(664 | 985)+-1*(~664))+(1813110428179549919))+(3614957860340306))%2**53)
        ĳⅉĲIĴĲÎĳⅉĴḬjJǉǉｊjｊǉliĲḬJǉJlJÎǉ: int = ((243*((1*(850 | 702)+-1*(850 & ~702)+-1*(702)+0*(850 | ~702))+(26653))+(559))%2**10)
        jlĴÎｊjlĴǉiⅉiⅉĲĲḬjĲIⅉḬĳǉJlÎÎiｊĳ: int = ((65209806072050588681*((0*(950 | ~10)+0*(-1)+-1*(~(950 | 10))+-1*(950 & ~10)+1*(~10))+(1424567629770351222635974))+(180568217466183666441))%2**68)
        return self.ret 
    
    def exit(self, ĲIÎĲĳlĲĲḬḬḬJⅉJǉIĲｊlÎiĴĲｊiⅉḬⅉĴĴ):
        lIJⅉiIĳǉÎǉÎiIĴÎÎJǉĲĴĳJĲlḬIｊIⅉj: int = ((440138381978813*((1*(540 & ~554)+1*(~(540 | 554))+-1*(~554)+0*(540 | 554)+0*(540))+(148862401434413641))+(138773445198137))%2**49)
        JḬⅉJiÎllḬjḬIĳĲiĳⅉⅉlIlĳⅉjｊÎjIjḬ: int = ((38169*((-1*(453)+2*(453 & ~87)+-1*(~(453 & 87))+1*(87)+1*(~(453 | 87)))+(502931181))+(10471))%2**16)
        ĲｊÎjĳḬǉḬJJⅉｊĲIḬǉĴJlḬⅉｊjJIｊÎĲĴI: int = ((5593*((1*(828 & ~418)+1*(~828 | 418)+-1*(-1)+0*(828 & 418))+(29577690))+(19784))%2**15)
        ⅉjÎⅉḬĲｊÎⅉJIĳĳǉⅉJｊjjJĳIｊjĴⅉjÎｊl: int = ((813853*((-1*(~58 | 853)+1*(~(58 ^ 853))+1*(~58 & 853)+0*(~58))+(1209389798))+(590178))%2**20)
        ĴJǉjÎJlⅉÎĳǉlĴǉjĳｊlⅉｊlǉｊiĴÎiĲjj: int = ((229123911835020452862155*((-1*(-1)+1*(~(713 ^ 979))+0*(713)+1*(713 ^ 979))+(9269403307485501887904057))+(215872380718573562628094))%2**79)
        IiĲĲliÎlḬｊⅉJĲｊⅉlǉIǉJlⅉⅉĳĲĳⅉĴli: int = ((17629965819*((-1*(-1)+0*(~(124 ^ 342))+1*(~124 | 342)+0*(~342)+1*(124 & ~342))+(23470477710504))+(7830948065))%2**35)
        jĴｊｊlĲḬｊiiJIｊĲiⅉliḬJḬJIJĳĴĲjǉⅉ: int = ((212065*((-1*(-1)+1*(811 | ~614)+0*(~(811 ^ 614))+1*(~811 & 614))+(320070860))+(164615))%2**19)
        ⅉĲĴJjjjÎiǉÎIĲJⅉjJｊĲÎiḬiǉIIḬǉjĲ: int = ((529551970734710899765737113*((1*(~(165 | 9))+0*(~165)+0*(~9)+-1*(~165 | 9)+1*(9))+(7760702990376448043951669210329))+(2029141768316195540570308784))%2**91)
        ḬḬÎĳĲḬjÎĲｊJIⅉĲĴⅉiĳÎĳiliĲJIǉĳJĳ: int = ((188302590566820032094455299*((0*(952)+-1*(796 & ~952)+1*(~952)+-1*(~(796 | 952)))+(759705936855111914678769560336))+(261843950770242789662468891))%2**88)
        self.cont = False
        self.ret = ĲIÎĲĳlĲĲḬḬḬJⅉJǉIĲｊlÎiĴĲｊiⅉḬⅉĴĴ


    # Handlers

    # General 
    def handle_pop_top(self):
        ⅉĳǉlǉⅉJĴｊĲǉḬĲĴĲiｊⅉｊjǉĳḬｊĳllｊḬJ: int = ((5129530808512121*((-1*(-1)+1*(~(882 | 369))+1*(~882 & 369)+1*(882))+(13945524002766208796))+(7241441935704130))%2**53)
        jIĴJjĴⅉĲIĲĴjḬḬIⅉJｊijｊⅉⅉĳiｊĴjḬl: int = ((21525*((0*(130)+-1*(-1)+1*(~465 | 130)+0*(~(465 ^ 130))+1*(465 & ~130))+(157303606))+(24288))%2**15)
        ĳÎⅉĴⅉǉｊｊǉⅉĴｊĲiĴḬǉḬĲĳÎḬijĳJḬllI: int = ((223282400023023*((0*(~(503 ^ 10))+-1*(10)+0*(~10)+1*(~503 & 10)+1*(503 & 10))+(420703756843782516))+(142197549604556))%2**48)
        jĳlIĴĲｊIḬJⅉḬjĴĴĲÎÎĳｊĳĲǉIjⅉｊJjÎ: int = ((656122248155*((2*(916 & ~5)+-1*(~5)+-1*(916)+1*(~(916 ^ 5)))+(2075110652198616))+(1326628178631))%2**41)
        iⅉĳiｊIJJⅉiJJJｊĳjJĲǉjijⅉiĴÎjiⅉJ: int = ((1699462360709408229*((1*(~588)+-1*(-1)+1*(588)+0*(~588 | 802))+(1453127614100988802546))+(893550149896457316))%2**61)
        ｊÎⅉḬÎjÎÎḬｊḬǉĴḬÎIJĴｊⅉJĳḬÎIĴĲIiI: int = ((57433285*((-1*(~720 | 425)+1*(~720)+0*(~(720 | 425))+1*(720 & 425)+0*(720 ^ 425))+(352403427041))+(86522812))%2**27)
        ĴḬjḬḬĲĳjjḬÎｊｊｊJḬiḬlilĴĳÎÎǉjlｊĲ: int = ((75977021*((-1*(~(646 | 130))+1*(~(646 & 130))+-1*(646 ^ 130)+0*(646 | 130))+(159826417146))+(109134005))%2**27)
        ⅉliｊḬĳJJĴÎiÎǉÎjｊⅉlĴｊǉĳｊĳĳiḬlIǉ: int = ((2458816782592863749*((1*(~(346 ^ 356))+-1*(346)+-1*(~346)+1*(346 ^ 356))+(12242219848268234157059))+(3881287698981399764))%2**62)
        IⅉjǉjｊǉｊḬllJⅉÎǉlⅉJḬĳJiIIｊiḬĴĲｊ: int = ((51380787*((0*(556 ^ 467)+-1*(~467)+-1*(467)+1*(556 | ~467)+1*(~556 & 467))+(8189821679))+(47271246))%2**26)
        JjǉlIǉｊilĴJIḬĴJjĴiÎｊｊǉlJｊĲliḬi: int = ((473436488882558010529608078177*((0*(875)+0*(~705)+-1*(-1)+1*(~705 | 875)+1*(705 & ~875))+(4979292735403140952050695691241916))+(456587751196391180289120565958))%2**99)
        self.stack.pop()
        lḬĲIĴĲⅉĴÎḬJIJiĲJlĳlĲĴiǉjlJÎｊḬĳ: int = ((207931*((-1*(197 | 98)+-1*(~197)+1*(~(197 & 98))+0*(197 ^ 98)+1*(98))+(158066058))+(25742))%2**18)
        ｊĴḬǉǉḬĳⅉĴÎǉlĴilḬÎlljḬiIIⅉｊḬJjĳ: int = ((415*((1*(300 & ~244)+-1*(300 | 244)+0*(~300)+0*(300 & 244)+1*(244))+(330559687))+(50302))%2**17)
        iÎḬǉĴÎĴǉlⅉĴḬJiⅉjĲIIJｊĲÎｊJｊĳÎǉⅉ: int = ((7261484068225502456250830705*((1*(164 & 168)+1*(164 | 168)+-1*(-1)+-1*(168)+1*(~164))+(61471825674435054834038249438492))+(5682892299377798356393493600))%2**93)
        lⅉｊjiḬḬḬiｊJÎĲlｊĴｊiJÎḬJｊIlǉḬjÎｊ: int = ((1093630881338205422125*((1*(~443 & 728)+0*(~443 | 728)+-1*(728)+0*(443 | 728)+1*(443 & 728))+(30232381014170922458928092))+(1498635553112261077183))%2**72)

    # Loading
    def handle_load_fast(self, lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI: int):
        """
        Pushes a reference to the local co_varnames[var_num] onto the stack
        """
        ⅉijḬǉĴlḬĲjĳIlljⅉĲÎḬjǉiⅉiJḬⅉĳĴĴ: int = ((1713147742606700565824367*((-1*(~lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI)+-1*(lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI | ~lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI)+1*(~(lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI & lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI))+1*(~(lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI ^ lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI))+0*(~lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI))+(13482973220699934256980217940))+(4470255249582417025876494))%2**82)
        self.stack.append(self.varnames[lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI])
        JIǉḬｊĴĲĴIIǉǉiÎǉJĳjĳĳĲiḬĳĲｊǉiｊǉ: int = ((42902984254175603716657*((-1*(~lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI)+1*(~(lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI ^ lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI))+1*(lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI ^ lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI)+-1*(lⅉÎiḬｊｊǉÎĲｊÎJḬĳĳǉĲĴJⅉljĳJĳllⅉI))+(42251772727116977865604345))+(55770519655524960990418))%2**76)
    
    def handle_load_const(self, ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl: int):
        ĳĲIḬǉｊǉiĲḬḬiJĴĳḬⅉḬÎĲḬJJｊĴiiljl: int = ((72303935*((-1*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl & ~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+-1*(~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+0*(~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+1*(~(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl & ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)))+(775169548226))+(44008606))%2**27)
        ĴJjIiilJiǉḬǉⅉIḬⅉǉĳǉJĳⅉǉJlǉĳjĲl: int = ((8577889090940457*((1*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl ^ ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+-1*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+-2*(~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl & ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+0*(~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+1*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl))+(3376463553412156070))+(1883514419231220))%2**53)
        ĴĲｊĳIÎÎǉIḬĳḬÎIĴḬⅉjÎĲjḬlḬĲijIÎĲ: int = ((281590673789*((0*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl & ~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+1*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl | ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+-1*(-1)+1*(~(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl | ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)))+(11637916379556463))+(1368716748808))%2**41)
        ｊiｊIｊǉjJiÎJÎlḬjⅉĴĲiIiiḬIĳĳÎḬIĳ: int = ((449287339824829257694542086127*((1*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+-1*(~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+0*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+-2*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl & ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+1*(~(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl ^ ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)))+(3231882602466938367790710985228964))+(1041914706654373949978396311020))%2**100)
        iǉIｊÎⅉiIĲjḬIÎiĴiiIĴĳĴｊlĲḬｊIÎĲḬ: int = ((224887*((-1*(-1)+1*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl | ~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+0*(~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl | ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+1*(~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl & ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl))+(411668190))+(86448))%2**18)
        """
        Pushes co_consts[consti] onto the stack.
        """
        ḬjIǉⅉĲĴⅉiJḬlǉIlĴljⅉlｊIǉIĳⅉlJJÎ: int = ((19355432971241768914357547*((1*(~(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl | ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl))+0*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl ^ ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+-1*(~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl | ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+1*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl))+(192272214888518981960568610478))+(35450392445276375667579370))%2**86)
        IlḬIĳlⅉiｊlIJḬJḬĴÎJⅉĴｊḬIⅉIⅉÎJｊĳ: int = ((5716681357272111*((-1*(~(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl | ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl))+-1*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+1*(~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl & ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+1*(~(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl ^ ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)))+(23963879989826555470))+(50461318324321490))%2**57)
        jjlĲĳḬÎǉiiiiilǉḬJiIÎｊｊⅉĲIÎiǉJｊ: int = ((5710680369083822949*((0*(~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl | ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+-1*(~(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl & ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl))+0*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+-1*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl & ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+1*(-1))+(72679848322776358680235))+(6645316622454209133))%2**64)
        ⅉḬⅉIllĴlIlḬĲiĳḬiⅉÎJiiⅉĲĴjĳǉĴǉÎ: int = ((10575843481813573*((0*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl & ~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+-1*(-1)+1*(~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl & ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+1*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl | ~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl))+(124905224047221179904))+(22823945742185672))%2**55)
        ḬÎḬIJjｊIiÎlIJḬｊIlḬｊĲIⅉIIĳlⅉĳĳJ: int = ((762029495537587*((0*(~(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl | ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl))+-1*(-1)+1*(~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl & ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl)+1*(ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl | ~ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl))+(35622202314222031686))+(10972659395805611))%2**54)
        self.stack.append(self.consts[ĲǉlĳiĴⅉḬĲjÎJIⅉJilljĳJĴljJlIiÎl])
    
    def handle_load_global(self, ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ: int):
        JijIĳĲJÎｊiĲiJiḬĲÎｊIǉǉĲllÎIǉĲⅉj: int = ((6126925151*((0*(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ & ~ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+1*(-1)+-1*(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ & ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+-1*(~(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ & ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)))+(9644215422558))+(3899422705))%2**34)
        jjjｊÎｊǉḬlｊǉlｊĴĲĳÎIÎĲIｊĳĴIIḬÎḬI: int = ((3219672936527856670893917363*((1*(~ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ | ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+-1*(~ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ & ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+-1*(-1)+0*(~(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ | ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ))+1*(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ ^ ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ))+(1640964093722018495926738519887))+(2405133815453143305710595565))%2**92)
        ÎǉIｊｊJjｊǉĴjḬḬĳÎIĲjlIｊĴllJlIĴｊĴ: int = ((255464629569*((1*(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ & ~ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+-1*(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ ^ ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+-1*(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+0*(~(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ ^ ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ))+1*(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ | ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ))+(73778816964888))+(257811941819))%2**39)
        ｊⅉǉｊǉḬJiⅉĲḬlIĲĲⅉḬĲJIⅉĳIJÎḬiǉJI: int = ((146533768387669878073650623*((-1*(~(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ & ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ))+1*(~ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+1*(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ & ~ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+0*(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ))+(9540940924716903798372230070254))+(3817127742802403190200222210))%2**92)
        ⅉJǉIĲǉⅉĳǉǉｊlĳÎIIÎｊÎⅉｊĳĴJjｊḬjｊÎ: int = ((479105970818950853*((1*(-1)+-1*(~(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ | ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ))+-1*(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+-1*(~ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ & ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ))+(2442285284167023196206))+(1126986572726419395))%2**60)
        """
        Loads the global named co_names[namei] onto the stack
        """
        ǉǉｊÎJĲｊｊÎiǉÎｊḬĲlÎǉĳJｊÎJIĴiḬĳiĴ: int = ((443261*((0*(~ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ | ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+-1*(~ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ & ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+-1*(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ)+0*(~(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ | ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ))+1*(ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ | ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ))+(1266778795))+(71235))%2**19)
        self.stack.append(self.names[ĲⅉijĳĴÎⅉⅉJĲJlｊiĴｊḬｊlÎiǉｊjjｊĲǉÎ])

    def handle_setup_finally(self, ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj: int):
        ⅉÎǉJijĲǉJĴIĴⅉIḬḬJIĲⅉÎĴĲjĲǉǉĲlI: int = ((41863317*((-1*(~(ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj & ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj))+1*(-1)+-1*(~(ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj ^ ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj))+1*(~(ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj | ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj)))+(90501614642))+(11598821))%2**26)
        ｊJĴḬlｊĳjḬIJĴｊiḬIⅉJĴJｊĴJǉJĲijｊj: int = ((66226017247*((2*(~(ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj ^ ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj))+1*(~(ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj & ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj))+-3*(ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj | ~ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj)+-1*(ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj)+2*(ḬÎJÎIĳIĴĴIiiÎiÎJǉIiIÎｊĳĲlĴｊǉĳj))+(235532554597155))+(37426130487))%2**36)
        """
        Pushes a try block from a try-finally or try-except clause onto the block stack. 
        delta points to the finally block or the first except block.
        """

    # Storing
    def handle_store_fast(self, JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj: int):
        ĳḬⅉⅉJIĳjĴjiĲjlｊĴÎḬĳjĳÎÎⅉjIiⅉⅉⅉ: int = ((785563609114518865191*((-1*(~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+1*(-1)+0*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | ~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+-1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+0*(~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+(668108039290418708607721))+(1000002316958745475427))%2**70)
        JĲǉjḬḬlｊｊjÎlĳjilǉIiǉlĲĳiIｊiilḬ: int = ((138217880363982296674007*((-1*(~(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj ^ JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+-1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj ^ JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj & ~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+1*(~(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)))+(331417581497240320100918306))+(317861328242123214740694))%2**79)
        ｊĳJⅉĴǉĴĳlJｊĴĳĲｊiｊljÎḬĴｊĳⅉǉⅉｊｊj: int = ((402364709476295*((-1*(~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+1*(~(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+-1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj & JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+(686332956758479931))+(10077524367666))%2**49)
        IĴĳjÎĴIḬĲÎĲĲĲĲjJｊJIǉÎḬJǉÎḬǉｊĴĳ: int = ((35395022210176222136899567003*((-1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | ~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+0*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+-1*(~(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)))+(55860762797531676039575906529539))+(1303267220203183907020629747))%2**95)
        jĳḬjĳⅉlÎĳｊIĲĲĴｊĳIĲĳｊｊḬⅉIjIｊĲĳĳ: int = ((495810245*((-1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj & ~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+0*(~(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj ^ JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+-1*(~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+1*(-1))+(2498073313422))+(484147511))%2**29)
        ｊJĳJiḬǉIḬjiｊｊǉIJⅉĲⅉiĲĴJiĲjｊǉĲｊ: int = ((13008277850583*((-1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj & ~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+-1*(~(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj ^ JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | ~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+0*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+0*(-1))+(38301340260040661))+(3430269972591))%2**44)
        jĴĳḬⅉÎÎjIⅉjIIḬḬJiĴJĳJǉĲｊlǉiÎǉĳ: int = ((31107932571910567*((1*(~(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj ^ JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+-1*(~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+-2*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj & JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+0*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj ^ JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+(5302000252823356405))+(14431856364783669))%2**55)
        ḬĴǉiĴJĲⅉĴiĳｊĲlḬÎjÎĳǉiĲｊｊĴｊǉⅉĴI: int = ((29788620940541619*((-2*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | ~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+-1*(~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+0*(~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+(91151360521177294592))+(126744078374408659))%2**57)
        ĳiⅉⅉⅉĳⅉĴlⅉlIiJllǉiiⅉjjÎJiJĴĴĴJ: int = ((8625357065110499933*((1*(~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj & JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+-1*(~(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj & JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+0*(~(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+1*(~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+0*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+(6990452412348232718796))+(7472971540012505510))%2**63)
        IlǉĴĲĳJijｊĴIĳiǉĲǉｊḬｊｊｊḬⅉⅉǉIĲⅉｊ: int = ((14240917795650031*((1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+-1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | ~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+-1*(~(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj & JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+0*(~(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj ^ JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+2*(~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+(51076481460287668859))+(15599389409664562))%2**54)
        ĳiⅉÎJĲJJliJÎÎĲĲĳḬĴlĲｊlÎlǉｊǉｊjl: int = ((221324501751875035839*((0*(~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj & JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+-1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | ~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+1*(-1)+1*(~(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+-1*(~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+(537450800133016176983462))+(84836494100258602063))%2**68)
        """
        Stores TOS into the local co_varnames[var_num]  
        """
        ḬĲĳlⅉIjḬiⅉJĳIÎiĲǉⅉⅉĴǉⅉĲǉｊJJĴḬｊ: int = ((1151322792847683513*((-1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj & JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+-1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj ^ JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+1*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj | JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj)+0*(JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj & ~JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj))+(1766434203122602898674))+(290313797574399320))%2**60)
        ｊḬĲÎĳḬｊĴĲⅉIĳĳⅉｊⅉǉiÎlĲJḬⅉⅉｊĲJji = self.varnames[JｊIĲIJǉĲḬǉIÎĳIĴÎⅉĳjｊJⅉjJⅉJǉⅉJj]
        self.varnames_map[ｊḬĲÎĳḬｊĴĲⅉIĳĳⅉｊⅉǉiÎlĲJḬⅉⅉｊĲJji] = self.stack.pop()

    # Binary ops
    def handle_binary_or(self):
        JｊiḬIÎĲḬjĳḬｊJlIǉĲJJjjÎǉÎJĴⅉlǉI = self.stack.pop()
        ĳǉǉjǉḬⅉjĳjiIÎⅉÎIĴIĲĳǉjǉiⅉjÎjĳｊ: int = ((11364947852440791783457*((0*(334 | ~286)+0*(~(334 & 286))+-1*(~334)+-1*(334 & 286)+1*(~334 | 286))+(660333000786227937497333))+(457093899120499628344))%2**74)
        ⅉjÎJjlǉḬĲḬlliⅉĳĴJJḬⅉḬÎjǉĲｊJiĳi: int = ((4867320289180634812186427*((1*(~586 & 456)+-1*(~(586 & 456))+0*(586 | ~456)+1*(~456))+(15752243182929306251367278152))+(8050323762605048753307012))%2**83)
        ǉIIĲIĲｊĳｊjJǉiiÎllⅉĲĲĳḬǉǉIÎǉĴĴĳ = self.stack.pop()
        ĲǉĴḬiÎIĴĲĴÎⅉĴIlĳｊĴḬḬｊĳiⅉǉJǉⅉiｊ: int = ((47780293019*((-1*(~37 | 999)+1*(37 & 999)+0*(~(37 & 999))+1*(~37))+(187930571381281))+(28949789963))%2**36)
        if JｊiḬIÎĲḬjĳḬｊJlIǉĲJJjjÎǉÎJĴⅉlǉI in self.varnames_map:
            JｊiḬIÎĲḬjĳḬｊJlIǉĲJJjjÎǉÎJĴⅉlǉI = self.varnames_map[JｊiḬIÎĲḬjĳḬｊJlIǉĲJJjjÎǉÎJĴⅉlǉI]
        JÎIljḬĳIǉÎĳlĲJĴÎⅉÎｊjĳJIĳĴĳĲĴIｊ: int = ((1626432225921389900072797087*((1*(~994 & 163)+0*(994 & ~163)+-1*(~994)+0*(~994 | 163)+1*(~(994 | 163)))+(1036142190345968609833548696739))+(866038527119455720492156194))%2**91)
        iIĳjĲjǉḬJJJĴĲIǉｊIⅉḬljⅉĳiǉĳⅉｊḬĴ: int = ((37072483907464736405364711*((0*(~(898 ^ 420))+0*(898 | 420)+-1*(-1)+1*(~898 | 420)+1*(898 & ~420))+(27833272218129420872378719033))+(8284249702116365038824067))%2**85)
        if ǉIIĲIĲｊĳｊjJǉiiÎllⅉĲĲĳḬǉǉIÎǉĴĴĳ in self.varnames_map:
            ǉIIĲIĲｊĳｊjJǉiiÎllⅉĲĲĳḬǉǉIÎǉĴĴĳ = self.varnames_map[ǉIIĲIĲｊĳｊjJǉiiÎllⅉĲĲĳḬǉǉIÎǉĴĴĳ]
        if self.debug:
            print(f"handle_binary_or {JｊiḬIÎĲḬjĳḬｊJlIǉĲJJjjÎǉÎJĴⅉlǉI} {ǉIIĲIĲｊĳｊjJǉiiÎllⅉĲĲĳḬǉǉIÎǉĴĴĳ}")
        jiⅉjⅉllĳiⅉḬｊjĴǉĴĲⅉiÎÎiÎJjIĴlĳI: int = ((1387527*((-1*(287)+1*(~510 | 287)+0*(510 & 287)+-1*(~(510 & 287))+1*(510 ^ 287))+(690855759000))+(48358838))%2**27)
        ĲḬlǉjÎⅉｊjĴⅉĲǉjĳIjjǉÎjĳḬiĴjiiÎl = ǉIIĲIĲｊĳｊjJǉiiÎllⅉĲĲĳḬǉǉIÎǉĴĴĳ | JｊiḬIÎĲḬjĳḬｊJlIǉĲJJjjÎǉÎJĴⅉlǉI
        self.stack.append(ĲḬlǉjÎⅉｊjĴⅉĲǉjĳIjjǉÎjĳḬiĴjiiÎl)

    def handle_binary_and(self):
        ǉǉĴｊÎÎḬĲJĴĴⅉḬlⅉĲｊⅉǉIĴĴǉĳÎǉĴjǉJ: int = ((83494385537*((0*(806)+1*(-1)+-1*(451 | 806)+-1*(~(451 | 806)))+(14382973336827))+(127524037893))%2**37)
        jjJｊĳĴjĳiĴÎǉijiIḬjjĳjǉjĲJJĳǉĲÎ = self.stack.pop()
        IĴÎⅉlĴĲĲjĲĳlĴｊiǉIIIĴiĳⅉⅉijÎÎḬi = self.stack.pop()
        iÎǉĴｊliĲḬjḬJĳĳｊiÎĳJĴjḬlｊｊÎⅉIjĲ: int = ((333496588969114735675*((2*(~(381 | 558))+1*(381 | 558)+-1*(381 | ~558)+-1*(~381))+(1703469021553982201628844))+(379106930843337758458))%2**70)
        iĳjⅉIḬlĴⅉjĳjJⅉÎĲĴjJⅉĳｊĳⅉlｊｊIjÎ: int = ((2195767628518587324787898791*((-1*(~169)+1*(~(671 | 169))+0*(169)+1*(671 & ~169))+(6084014114942361543341222055727))+(593783396254848900278120335))%2**91)
        if jjJｊĳĴjĳiĴÎǉijiIḬjjĳjǉjĲJJĳǉĲÎ in self.varnames_map:
            jjJｊĳĴjĳiĴÎǉijiIḬjjĳjǉjĲJJĳǉĲÎ = self.varnames_map[jjJｊĳĴjĳiĴÎǉijiIḬjjĳjǉjĲJJĳǉĲÎ]
        if IĴÎⅉlĴĲĲjĲĳlĴｊiǉIIIĴiĳⅉⅉijÎÎḬi in self.varnames_map:
            IĴÎⅉlĴĲĲjĲĳlĴｊiǉIIIĴiĳⅉⅉijÎÎḬi = self.varnames_map[IĴÎⅉlĴĲĲjĲĳlĴｊiǉIIIĴiĳⅉⅉijÎÎḬi]
        jĳĲijÎĲḬĴĳｊⅉĳjiIǉḬilǉĲĴĳiiĳĲｊⅉ: int = ((2260716517*((-2*(739 & ~103)+0*(~739)+-1*(~739 | 103)+1*(~103)+1*(739 | 103))+(7903322678757))+(3857911001))%2**32)
        if self.debug:
            print(f"handle_binary_and {jjJｊĳĴjĳiĴÎǉijiIḬjjĳjǉjĲJJĳǉĲÎ} {IĴÎⅉlĴĲĲjĲĳlĴｊiǉIIIĴiĳⅉⅉijÎÎḬi}")
        lǉⅉiiiÎĴĴllĳǉⅉⅉiĳJĴĴllĲlĳÎjlIi = IĴÎⅉlĴĲĲjĲĳlĴｊiǉIIIĴiĳⅉⅉijÎÎḬi & jjJｊĳĴjĳiĴÎǉijiIḬjjĳjǉjĲJJĳǉĲÎ
        ÎjⅉiilｊĳjJⅉJⅉⅉｊｊǉJĴÎllijĴlⅉĴĴl: int = ((150424345*((-1*(~(563 ^ 549))+-1*(~(563 & 549))+-1*(563 | 549)+0*(563)+2*(-1))+(9594375353075))+(113205433))%2**32)
        self.stack.append(lǉⅉiiiÎĴĴllĳǉⅉⅉiĳJĴĴllĲlĳÎjlIi)
    def handle_binary_xor(self):
        ĴĴIiǉJIⅉÎiĳⅉIĲIIｊⅉⅉjĴjĳlJJÎiⅉḬ = self.stack.pop()
        ÎIjĲĳlǉÎjḬĲlⅉｊｊⅉÎJIiĴJĲḬlｊiĲｊJ: int = ((9007*((0*(583)+0*(583 ^ 726)+1*(583 & 726)+-1*(~(583 ^ 726))+1*(~(583 | 726)))+(1910755688))+(747734))%2**21)
        JⅉⅉⅉｊJlIĲlIｊliiǉliḬÎｊⅉĳｊⅉĳÎĳĲⅉ: int = ((3347265579892445*((1*(~820 | 454)+3*(820 & ~454)+1*(820 & 454)+-2*(820)+-1*(~(820 & 454)))+(8576078268795307946))+(4244244802603890))%2**52)
        ĴĳĴlIĴĳiIĴǉĲｊIĴJÎǉlḬÎĲjÎJÎljĲⅉ: int = ((809435*((0*(~300 | 868)+1*(300 & 868)+-1*(300 | ~868)+1*(~868))+(5375625724))+(946262))%2**21)
        ĳĲｊⅉǉǉｊJｊIǉǉliĴjｊĳIIÎlｊÎliiḬiI: int = ((344049920311522786183*((1*(777 & ~692)+-1*(-1)+1*(~(777 ^ 692))+0*(692)+1*(~777 & 692))+(1945830388238647016331104))+(1520709458318856891752))%2**71)
        ⅉǉḬｊÎIilJḬǉiḬJiｊJĴḬlJjⅉIÎJilǉⅉ: int = ((595812905824339*((1*(~(29 & 150))+-2*(29 & ~150)+-1*(~29 | 150)+1*(29))+(2288877745758654173))+(686327163784101))%2**50)
        ĴlĴÎjiĴｊÎiｊljlĴĴIJIÎｊIĲIĳjĳⅉiｊ: int = ((3652669877768020971*((1*(~606 | 475)+-1*(-1)+1*(~475)+-1*(606 | ~475)+1*(606))+(3659692797350516007938))+(811921657848639546))%2**62)
        ｊJÎlĴJlǉｊĳÎḬliｊĳJｊḬĲJḬIĴJJĳĳĲj: int = ((437804744369*((1*(451 | 7)+1*(~7)+1*(~451 | 7)+-2*(-1))+(581941323126775))+(17328733628))%2**39)
        ḬⅉjlḬĳIĴiiiiĴĴĴⅉiｊḬÎjⅉĴḬｊÎIｊḬÎ: int = ((2010385585857*((-1*(493 & 647)+-1*(~(493 & 647))+0*(~493 & 647)+1*(-1))+(789609171086375))+(2193898970680))%2**42)
        IjÎliｊjjĲｊｊǉǉĴⅉiÎḬḬⅉḬjǉiĳÎJiĲḬ: int = ((51187736593264381114539*((0*(~795 | 783)+0*(~(795 | 783))+-1*(795 & ~783)+-1*(~795 & 783)+1*(795 ^ 783))+(146706261220669721527255252))+(1198653339367603585160609))%2**80)
        jÎJǉĳḬÎiÎǉiⅉlĴlｊǉǉǉlĲḬｊIĲĳḬǉiÎ = self.stack.pop()
        lｊḬJⅉlǉIḬḬJĳḬⅉĳllĳĳJÎĳJĳIĳĳJǉi: int = ((35374128266052685468677*((-1*(~(486 | 924))+-1*(~486 & 924)+0*(924)+0*(486)+1*(~486))+(1356940941440453493473248842))+(96195188928371968223786))%2**78)
        ĲIḬｊjjlｊǉilÎⅉĲÎĴiliĴḬiǉjjlĳIĴi: int = ((1092578670262333444423737*((1*(~211)+-1*(~168)+1*(211 ^ 168)+-2*(~211 & 168))+(3869648836319810708182277900))+(1054956339031913437933763))%2**81)
        IĳĴｊǉJｊjǉiJⅉljJIiⅉĲĴĴĳJḬĲĲiÎÎI: int = ((490902517565*((-5*(~84)+-4*(84 & ~156)+5*(~(84 & 156))+-1*(84 | 156)+1*(156))+(5542856197405804))+(528421010314))%2**40)
        if ĴĴIiǉJIⅉÎiĳⅉIĲIIｊⅉⅉjĴjĳlJJÎiⅉḬ in self.varnames_map:
            ĴĴIiǉJIⅉÎiĳⅉIĲIIｊⅉⅉjĴjĳlJJÎiⅉḬ = self.varnames_map[ĴĴIiǉJIⅉÎiĳⅉIĲIIｊⅉⅉjĴjĳlJJÎiⅉḬ]
        ⅉｊĴÎJｊĳiⅉIⅉJlJⅉlIⅉĳIĲｊⅉĳiĴⅉⅉÎǉ: int = ((254808467407571*((-1*(~(456 | 573))+1*(~573)+1*(456 & 573)+-1*(456))+(2060134892646985710))+(157068808353656))%2**49)
        if jÎJǉĳḬÎiÎǉiⅉlĴlｊǉǉǉlĲḬｊIĲĳḬǉiÎ in self.varnames_map:
            jÎJǉĳḬÎiÎǉiⅉlĴlｊǉǉǉlĲḬｊIĲĳḬǉiÎ = self.varnames_map[jÎJǉĳḬÎiÎǉiⅉlĴlｊǉǉǉlĲḬｊIĲĳḬǉiÎ]
        ĲｊⅉIĴlJｊⅉĲĲｊIｊlⅉｊĲjĲiḬJǉｊⅉlIJl: int = ((27995139*((0*(540 & 99)+1*(540 & ~99)+-1*(540 ^ 99)+1*(~540 & 99))+(1369807716))+(9305652))%2**26)
        if self.debug:
            print(f"handle_binary_xor {ĴĴIiǉJIⅉÎiĳⅉIĲIIｊⅉⅉjĴjĳlJJÎiⅉḬ} {jÎJǉĳḬÎiÎǉiⅉlĴlｊǉǉǉlĲḬｊIĲĳḬǉiÎ}")
        jｊjJlｊⅉĳIĳĳĳÎｊĴÎjIiĴⅉĳｊǉⅉiĲⅉÎj = jÎJǉĳḬÎiÎǉiⅉlĴlｊǉǉǉlĲḬｊIĲĳḬǉiÎ ^ ĴĴIiǉJIⅉÎiĳⅉIĲIIｊⅉⅉjĴjĳlJJÎiⅉḬ
        self.stack.append(jｊjJlｊⅉĳIĳĳĳÎｊĴÎjIiĴⅉĳｊǉⅉiĲⅉÎj)

    def handle_binary_add(self):
        ÎÎĴiijJJĲlĳｊJIǉJḬｊJｊḬǉJIǉiǉĳĴĳ = self.stack.pop()
        ĴiĲǉｊiĴḬⅉJｊliｊｊǉĲĳÎÎĴIĳǉjｊｊiｊĲ: int = ((421557118701556771758529*((-1*(283 | 153)+0*(283 ^ 153)+1*(-1)+-1*(~(283 | 153)))+(792670917045026710872779485))+(490816637554730507631003))%2**80)
        ḬiḬĲlÎⅉĳǉĴｊǉĴǉⅉIjĴiḬIⅉlĴḬǉjｊĳi: int = ((48454611368492624441*((1*(~223 | 627)+1*(223 ^ 627)+-2*(-1)+1*(223 | ~627))+(9344841989014205535264))+(17608776283924842128))%2**67)
        liĳĲĲǉⅉJｊĳJIǉḬIⅉÎḬĳÎĴliⅉlǉiIǉĳ: int = ((20807123713*((0*(564 & ~186)+0*(~(564 ^ 186))+-1*(-1)+1*(564 | 186)+1*(~(564 | 186)))+(6852219288983847))+(1227189881135))%2**41)
        ḬǉĲĲiĳｊǉiijIJĲjĴJIḬlIĴｊIĲⅉIiĳJ: int = ((7133333290358401*((3*(~(219 ^ 817))+1*(~(219 & 817))+-4*(-1)+1*(219 & 817)+3*(219 ^ 817))+(18293286204277741786))+(953028814149570))%2**53)
        jÎĴjlĴḬǉｊJⅉĴjIĳJⅉiiⅉJĴIĴÎⅉlĳĳl: int = ((116605*((0*(~77 | 794)+1*(794)+-1*(-1)+0*(~77 & 794)+1*(~794))+(1110256473))+(443680))%2**19)
        JĴĴlJⅉḬｊjĴÎiiijĳĴĴĳｊĴĲJJiĲĳǉĳĴ: int = ((35872420831466501155563320265*((-1*(628 | ~174)+1*(628)+0*(~(628 & 174))+0*(~174)+1*(~(628 | 174)))+(8560137219451553076991966719015))+(10079946095843274789248864799))%2**95)
        jḬJĳIIĲÎiĳJIⅉiⅉjJIjÎĴljÎJĴĴｊⅉI: int = ((133134150976878010559788435*((2*(~(98 | 731))+-4*(98 & 731)+-3*(~731)+3*(98)+1*(~(98 ^ 731)))+(1264022769200434642146996376494))+(195912348204638178363113545))%2**89)
        ｊĴiĳĲǉIjｊĳⅉĲǉIilĲǉjḬḬJjjǉÎjiÎĲ: int = ((36107096811*((0*(141)+-1*(~439 | 141)+1*(~439)+1*(439 & 141))+(12697856938659))+(31740822440))%2**36)
        ｊÎilJIÎĴIIĳÎjÎiJǉIJĳｊĲÎⅉJĳJJḬJ: int = ((564686160539036521*((0*(192 | 575)+1*(192 | ~575)+-1*(-1)+1*(~192 & 575))+(1896894476477690204700))+(664880357934180703))%2**60)
        ǉǉĴⅉiḬⅉiĳǉJIĲjJｊJĳĴIiJJÎiḬĲĳǉĴ = self.stack.pop()
        if ÎÎĴiijJJĲlĳｊJIǉJḬｊJｊḬǉJIǉiǉĳĴĳ in self.varnames_map:
            ÎÎĴiijJJĲlĳｊJIǉJḬｊJｊḬǉJIǉiǉĳĴĳ = self.varnames_map[ÎÎĴiijJJĲlĳｊJIǉJḬｊJｊḬǉJIǉiǉĳĴĳ]
        ĳⅉⅉĲĳĲjjĳⅉlǉĴĳIiｊĴJÎIIĳĴjĳjJjⅉ: int = ((954498497794929204204277*((-2*(~463 | 49)+0*(463 | 49)+1*(~(463 ^ 49))+1*(~463)+1*(49))+(4651298014120222373536544026))+(3996152992727011562120909))%2**82)
        ÎḬÎĲĲĲÎⅉｊⅉĴĳｊJⅉｊÎｊǉḬⅉliiĳĲĳJḬǉ: int = ((57426846803863412317*((-1*(788 & 297)+-1*(~297)+0*(~(788 | 297))+1*(788 | ~297))+(222960890179673158731348))+(23070780476499340450))%2**66)
        IiJĳjǉIĳĳliǉǉǉĴIJĳĳlÎÎǉĲĳĳⅉⅉÎǉ: int = ((83695409*((0*(629 & 455)+1*(-1)+-1*(629 | 455)+-1*(~629 | 455)+1*(455))+(47459518395))+(11212290))%2**27)
        if ǉǉĴⅉiḬⅉiĳǉJIĲjJｊJĳĴIiJJÎiḬĲĳǉĴ in self.varnames_map:
            ǉǉĴⅉiḬⅉiĳǉJIĲjJｊJĳĴIiJJÎiḬĲĳǉĴ = self.varnames_map[ǉǉĴⅉiḬⅉiĳǉJIĲjJｊJĳĴIiJJÎiḬĲĳǉĴ]
        if self.debug:
            print(f"handle_binary_add {ÎÎĴiijJJĲlĳｊJIǉJḬｊJｊḬǉJIǉiǉĳĴĳ} {ǉǉĴⅉiḬⅉiĳǉJIĲjJｊJĳĴIiJJÎiḬĲĳǉĴ}")
        ǉlJⅉⅉĲĳÎJｊJǉĳｊĳĲǉḬĲÎlĳÎǉｊlIｊIｊ = ÎÎĴiijJJĲlĳｊJIǉJḬｊJｊḬǉJIǉiǉĳĴĳ + ǉǉĴⅉiḬⅉiĳǉJIĲjJｊJĳĴIiJJÎiḬĲĳǉĴ
        self.stack.append(ǉlJⅉⅉĲĳÎJｊJǉĳｊĳĲǉḬĲÎlĳÎǉｊlIｊIｊ)
    
    def handle_binary_subtract(self):
        ĲljĲｊjjÎĲĲjⅉǉjḬⅉÎiⅉǉⅉǉĳJiǉlJjĲ = self.stack.pop()
        lｊḬJiĳĴⅉiÎǉĴǉJĴÎḬJĴIǉJÎÎⅉĲÎJĳÎ = self.stack.pop()
        ÎｊⅉJǉⅉḬⅉǉĳｊĳIJĳǉjiJIǉIḬÎiIĳⅉĴḬ: int = ((46282180979043728116609*((0*(732 & 75)+1*(~(732 & 75))+-1*(~732)+-1*(732 & ~75))+(650870516211431328714880928))+(203750443773640482221472))%2**78)
        if ĲljĲｊjjÎĲĲjⅉǉjḬⅉÎiⅉǉⅉǉĳJiǉlJjĲ in self.varnames_map:
            ĲljĲｊjjÎĲĲjⅉǉjḬⅉÎiⅉǉⅉǉĳJiǉlJjĲ = self.varnames_map[ĲljĲｊjjÎĲĲjⅉǉjḬⅉÎiⅉǉⅉǉĳJiǉlJjĲ]
        ḬĲJjｊĴǉĴḬjJIｊｊiĳiḬlĲIjÎjḬÎĳiḬĳ: int = ((1021410734240170431660872683967*((1*(891 ^ 537)+1*(891 | ~537)+-1*(~891 | 537)+-2*(891 & ~537)+0*(891 & 537))+(2052198112130651936037592596078693))+(335203593663682798052000933422))%2**100)
        if lｊḬJiĳĴⅉiÎǉĴǉJĴÎḬJĴIǉJÎÎⅉĲÎJĳÎ in self.varnames_map:
            lｊḬJiĳĴⅉiÎǉĴǉJĴÎḬJĴIǉJÎÎⅉĲÎJĳÎ = self.varnames_map[lｊḬJiĳĴⅉiÎǉĴǉJĴÎḬJĴIǉJÎÎⅉĲÎJĳÎ]
        if self.debug:
            print(f"handle_binary_subtract {ĲljĲｊjjÎĲĲjⅉǉjḬⅉÎiⅉǉⅉǉĳJiǉlJjĲ} {lｊḬJiĳĴⅉiÎǉĴǉJĴÎḬJĴIǉJÎÎⅉĲÎJĳÎ}")
        ÎĴlǉĴIĴÎｊⅉĴǉĲĴIjÎJⅉｊIIǉǉÎǉlĴij: int = ((1594756358393989867*((-1*(~(838 & 44))+2*(~44)+1*(44)+-1*(838 | ~44))+(7505797898778304257555))+(1234110936081445254))%2**63)
        JĴiｊĲǉJĴⅉḬJｊiｊǉⅉḬǉḬĴIĳḬĳĲliÎĴĳ: int = ((3186886572945083742945*((1*(~(846 ^ 732))+-2*(-1)+2*(846 | 732)+1*(~732)+-1*(846))+(10041872046732339815909963))+(16064724156589471831954))%2**74)
        JĳĳḬｊiIĲjÎJJJÎｊĲｊǉǉĳĴÎjḬjⅉḬĳĳJ = lｊḬJiĳĴⅉiÎǉĴǉJĴÎḬJĴIǉJÎÎⅉĲÎJĳÎ - ĲljĲｊjjÎĲĲjⅉǉjḬⅉÎiⅉǉⅉǉĳJiǉlJjĲ
        self.stack.append(JĳĳḬｊiIĲjÎJJJÎｊĲｊǉǉĳĴÎjḬjⅉḬĳĳJ)
    
    def handle_binary_multiply(self):
        jJĲⅉIjJjIljĲijjĳｊĲĳｊĴǉÎIJḬjjḬĳ = self.stack.pop()
        ｊḬⅉjiḬJjIlĴǉiIĴlĳĳⅉJḬlJiIJlĳÎⅉ: int = ((55*((0*(588 | 267)+-1*(~(588 ^ 267))+-1*(~588 & 267)+1*(~588 | 267))+(56803412))+(15907))%2**15)
        IĲĴǉĴjⅉÎIIḬǉĴlIIĴĴÎjlḬiĴjÎĲJĳǉ: int = ((81291260730729*((1*(472 & ~93)+-1*(472 ^ 93)+1*(~472 & 93)+0*(~93))+(443006726172924460))+(152284765294342))%2**48)
        JĲjJIJḬIĲｊĴiĴĳÎｊIⅉḬiǉIJĲḬĳÎÎḬḬ: int = ((75531551174189721*((-1*(~(563 & 999))+-2*(-1)+-1*(563 & 999)+3*(563 | 999)+3*(~(563 | 999)))+(2234160959337735337397))+(293790916878514090))%2**59)
        ⅉÎĲĴlḬⅉlÎĴĲḬIǉḬIĳⅉjlJJIilⅉĴjJĲ: int = ((466099193479*((-1*(26)+0*(25 ^ 26)+1*(~25 | 26)+-1*(~(25 | 26)))+(3802992166219727))+(58831654704))%2**39)
        IÎlｊⅉÎlｊjǉĲǉlĲĴĳḬÎJｊĳｊｊĳḬḬǉⅉǉÎ: int = ((29989202470989863493024385*((-1*(~(18 ^ 960))+-6*(18 & ~960)+-4*(~(18 | 960))+5*(~960)+1*(18))+(102710228207351992773539430152))+(36104178662722176843401342))%2**85)
        ḬḬĴjĲiJǉⅉjjlÎĳjiiĳIlJⅉIiⅉiĴiiḬ: int = ((73650011964365464873981*((0*(-1)+1*(~(942 | 670))+-1*(~942)+1*(~942 & 670))+(202969765581304681359401964))+(11600179913901626111265))%2**76)
        lｊｊⅉIljⅉlJⅉiｊⅉlJｊǉĳｊÎⅉĳIIIÎĴlj: int = ((26956570978849*((1*(~(195 | 391))+-1*(~195 | 391)+0*(195 & 391)+1*(391))+(141061326961153338))+(118434068614904))%2**47)
        ⅉJĲｊjḬlĳǉⅉǉĲIⅉĳĳiJĲĴḬjlḬǉĳllÎi: int = ((70684929543311240316535*((-1*(-1)+-1*(182 & ~555)+-1*(~182 & 555)+1*(182 | 555)+1*(~(182 & 555)))+(80449041995864609871776522))+(48163093106144452247213))%2**76)
        iJḬǉĳIiiÎĳĳĲlÎJÎlJIǉḬǉĴlｊiĴĲjl: int = ((271725915541799126403179*((1*(171 & ~305)+1*(~(171 | 305))+0*(~171)+-1*(~305))+(1058862307995915945979109538))+(514470955815278949607409))%2**79)
        jḬⅉĳIiĴⅉĳｊJĴḬĴḬÎⅉｊlⅉlĴⅉĲĴjĴⅉĴÎ = self.stack.pop()
        if jJĲⅉIjJjIljĲijjĳｊĲĳｊĴǉÎIJḬjjḬĳ in self.varnames_map:
            jJĲⅉIjJjIljĲijjĳｊĲĳｊĴǉÎIJḬjjḬĳ = self.varnames_map[jJĲⅉIjJjIljĲijjĳｊĲĳｊĴǉÎIJḬjjḬĳ]
        if jḬⅉĳIiĴⅉĳｊJĴḬĴḬÎⅉｊlⅉlĴⅉĲĴjĴⅉĴÎ in self.varnames_map:
            jḬⅉĳIiĴⅉĳｊJĴḬĴḬÎⅉｊlⅉlĴⅉĲĴjĴⅉĴÎ = self.varnames_map[jḬⅉĳIiĴⅉĳｊJĴḬĴḬÎⅉｊlⅉlĴⅉĲĴjĴⅉĴÎ]
        if self.debug:
            print(f"handle_binary_multiply {jJĲⅉIjJjIljĲijjĳｊĲĳｊĴǉÎIJḬjjḬĳ} {jḬⅉĳIiĴⅉĳｊJĴḬĴḬÎⅉｊlⅉlĴⅉĲĴjĴⅉĴÎ}")
        ĴjḬÎĲĴĲĲｊJÎｊｊjĳｊjⅉJijｊJĴIiĲlil: int = ((29002151*((0*(~(609 & 691))+1*(609)+-1*(609 | ~691)+1*(~(609 | 691)))+(180265417302))+(16234561))%2**26)
        IÎｊIÎĳǉǉĴĴĴĲǉĳllJĴⅉJilⅉǉIÎĲｊÎĳ = jJĲⅉIjJjIljĲijjĳｊĲĳｊĴǉÎIJḬjjḬĳ * jḬⅉĳIiĴⅉĳｊJĴḬĴḬÎⅉｊlⅉlĴⅉĲĴjĴⅉĴÎ
        self.stack.append(IÎｊIÎĳǉǉĴĴĴĲǉĳllJĴⅉJilⅉǉIÎĲｊÎĳ)
        ⅉlḬilĴIǉⅉlÎJĳijĴǉiⅉljｊĲⅉiǉḬĳlĳ: int = ((28692131126299*((1*(~642)+1*(642 & ~189)+-1*(~(642 & 189))+0*(642 & 189))+(34177990627118643))+(19948234324602))%2**45)
    
    def handle_binary_modulo(self):
        ⅉjǉiJJⅉĲiJǉlÎÎǉｊlllⅉⅉĳⅉliÎⅉjǉĳ = self.stack.pop()
        ĲĳⅉĳÎJⅉÎḬĲĴḬǉiｊIlḬjｊĴｊIǉⅉlĴｊǉḬ: int = ((103306547494077845436659*((-1*(381)+-1*(~381)+0*(531 & ~381)+0*(~531)+1*(-1))+(161376894953336579458708436))+(36018995623026238092976))%2**77)
        ⅉĴｊĳJĲḬḬIǉǉÎĴIJjĳJｊÎlĴijilljⅉÎ: int = ((889959466457*((-1*(478)+1*(~(478 ^ 301))+1*(478 & ~301)+-1*(~(478 | 301)))+(624234776501788))+(907697386321))%2**40)
        ｊlĳǉijjJiḬĴⅉilĳÎJⅉIJiḬJiiｊjill: int = ((884763771893960869373053*((-1*(763)+0*(-1)+1*(763 & ~748)+1*(763 & 748))+(13441130351474472513919602))+(77007141894698931998401))%2**80)
        ĲĲiIiIḬĴÎĲjÎｊJĳiḬjⅉiĲĴⅉǉiJⅉĴlI: int = ((372379309*((-1*(731 & 257)+1*(-1)+-1*(~(731 | 257))+-1*(731 ^ 257))+(401791555451))+(209123060))%2**30)
        ijJĲḬḬｊⅉĲǉjĲĴḬḬⅉｊiĲJÎⅉⅉlĲĲÎiJǉ: int = ((701215632042724179339*((-1*(631 & 510)+1*(631 | 510)+-1*(631 ^ 510)+0*(~631 & 510)+0*(-1))+(441171635289633310528044))+(1607028145950378485745))%2**71)
        ÎǉĲJÎÎĴḬÎÎiIIiilIiḬĳijḬlｊｊｊĲJĲ: int = ((24284254569*((1*(~443)+0*(94 ^ 443)+-1*(94 | ~443)+0*(~94)+1*(94 & 443))+(91078708345862))+(5263794455))%2**35)
        ĴĴⅉlĳiĴIｊǉⅉｊlJiÎJjjĳｊｊÎIÎĲⅉllI: int = ((97867481*((-1*(~381 | 680)+1*(~(381 ^ 680))+-1*(~(381 | 680))+1*(~381))+(234907383841))+(62815469))%2**27)
        ĴĳⅉiÎĲĳĳĳĴijjǉJĲIｊḬjḬiĴiĴḬｊĲÎĳ = self.stack.pop()
        jijlÎÎĴIiⅉÎjｊĲｊǉjJjĲⅉǉJJĲiIlⅉｊ: int = ((32182913505*((-1*(237)+1*(534 & 237)+1*(~534 & 237)+0*(534 | ~237))+(231420440491203))+(32910611604))%2**37)
        IJlｊÎḬJⅉĲĲiⅉlｊiĲǉǉjⅉÎｊǉjĴJIÎĳI: int = ((329548763*((1*(128 | ~980)+-1*(~(128 | 980))+0*(~(128 ^ 980))+-1*(128))+(206092430687))+(372331669))%2**29)
        ĳǉǉJliiIjlIǉlĲĲJⅉĳｊijḬⅉĳⅉǉǉlⅉÎ: int = ((1978974711144439772655695*((-1*(-1)+0*(77 & ~404)+-1*(~77 & 404)+1*(~(77 & 404))+1*(404))+(30903520892681214747536144748))+(2743424571558947599296415))%2**83)
        if ⅉjǉiJJⅉĲiJǉlÎÎǉｊlllⅉⅉĳⅉliÎⅉjǉĳ in self.varnames_map:
            ⅉjǉiJJⅉĲiJǉlÎÎǉｊlllⅉⅉĳⅉliÎⅉjǉĳ = self.varnames_map[ⅉjǉiJJⅉĲiJǉlÎÎǉｊlllⅉⅉĳⅉliÎⅉjǉĳ]
        ĲⅉḬjJjjĲjｊḬⅉǉĴḬIjĴjĲJIĳIlｊǉⅉｊｊ: int = ((14765616307*((0*(243)+-1*(~934)+-2*(934 & ~243)+1*(934 ^ 243)+1*(~243))+(30859212514458))+(8236351752))%2**34)
        if ĴĳⅉiÎĲĳĳĳĴijjǉJĲIｊḬjḬiĴiĴḬｊĲÎĳ in self.varnames_map:
            ĴĳⅉiÎĲĳĳĳĴijjǉJĲIｊḬjḬiĴiĴḬｊĲÎĳ = self.varnames_map[ĴĳⅉiÎĲĳĳĳĴijjǉJĲIｊḬjḬiĴiĴḬｊĲÎĳ]
        JǉⅉÎĳⅉiｊĲÎⅉĲĲjiiⅉJｊĲĴǉjĳⅉǉjiḬĳ = ĴĳⅉiÎĲĳĳĳĴijjǉJĲIｊḬjḬiĴiĴḬｊĲÎĳ % ⅉjǉiJJⅉĲiJǉlÎÎǉｊlllⅉⅉĳⅉliÎⅉjǉĳ
        self.stack.append(JǉⅉÎĳⅉiｊĲÎⅉĲĲjiiⅉJｊĲĴǉjĳⅉǉjiḬĳ)

    def handle_binary_power(self):
        lIḬｊÎĲIlIⅉĲǉlĲǉIｊⅉjlĲÎｊⅉÎIJｊĲJ: int = ((6181649*((-1*(-1)+0*(764 ^ 195)+1*(~195)+1*(195)+0*(764 & 195))+(19173483460))+(5840965))%2**24)
        IｊIiḬÎĴjjǉĳǉĴｊllⅉjⅉǉĴiIｊⅉIǉjｊĳ: int = ((113751579777*((1*(632 | 967)+-1*(~(632 & 967))+1*(~632)+-1*(967)+0*(~632 | 967))+(112168511246291))+(48707844340))%2**37)
        ḬjḬⅉĳḬĴｊḬｊⅉJlĲĳĲĳĲｊÎÎĲÎÎlÎĴlIｊ: int = ((1737429633016841*((-1*(~(68 ^ 466))+-1*(466)+-1*(~(68 & 466))+2*(~68 | 466)+1*(68 & ~466))+(14980304861916460582))+(3813211407290198))%2**52)
        ḬĲIǉḬǉÎIĴｊlǉIIIǉĴJÎḬḬĳjĲĴǉJiIÎ: int = ((74112733192536400648887*((-1*(~(654 ^ 804))+-1*(654 & ~804)+0*(654)+1*(654 | ~804))+(42634125711571699212638328))+(73730458849637708633246))%2**76)
        ÎĲḬĲjlǉḬĲiiĳlJlĳljlĴĳJjÎǉｊÎｊĴｊ = self.stack.pop()
        jlǉⅉÎḬĴｊǉlǉÎǉlｊḬｊÎｊĲⅉIḬĳḬiⅉÎǉḬ: int = ((1911668041210443135054367*((-1*(671 & 39)+-1*(~671 & 39)+0*(671 & ~39)+1*(39)+0*(~(671 | 39)))+(295781083873000259586835018))+(205521060751223006627744))%2**81)
        jĲjIｊⅉJIjｊĴｊĴｊlĳⅉｊĳJJĴIiÎĳĳIḬⅉ: int = ((211917288463863627019523*((0*(~(261 | 880))+1*(880)+1*(261 & ~880)+-1*(261 | 880))+(15429805178533162463181733702))+(2139349096120724787170090))%2**83)
        lJiiĲḬiIĲĴｊÎǉǉḬĲｊⅉⅉiĴlĴjḬlⅉJiĳ: int = ((3428042861419447985912385*((0*(~(953 | 546))+0*(~953 & 546)+-1*(-1)+1*(953 ^ 546)+1*(~(953 ^ 546)))+(149383466355608056964193881820))+(31807131849064896488016112))%2**85)
        JｊiĲjǉｊĴĳǉÎǉĳĲḬiÎJǉｊIǉｊlĴĳⅉĲij: int = ((354876613*((-1*(676 & 385)+-1*(~676)+1*(-1)+-1*(676 & ~385))+(7652367372489))+(12965293))%2**30)
        ḬiǉĲiiÎĴǉÎǉǉⅉJĳĴIĳlJJjÎĳⅉJIIǉi: int = ((1205474443408727168759*((-1*(596)+-2*(~(596 | 398))+1*(~398)+1*(~(596 ^ 398))+0*(~596 | 398))+(3327225796993682466776494))+(2271695059505793386290))%2**71)
        ⅉIjⅉｊⅉĲḬIĴǉｊiｊĴIｊḬJJÎjlilĳlḬjĴ = self.stack.pop()
        IḬĳjÎjĳlÎJÎJJⅉlIJIÎIǉllÎĴÎiĳJj: int = ((87397956952392359*((0*(348 | 120)+-1*(~348 & 120)+1*(120)+-1*(348 & 120))+(589466650300316459139))+(126912806291036008))%2**57)
        if ÎĲḬĲjlǉḬĲiiĳlJlĳljlĴĳJjÎǉｊÎｊĴｊ in self.varnames_map:
            ÎĲḬĲjlǉḬĲiiĳlJlĳljlĴĳJjÎǉｊÎｊĴｊ = self.varnames_map[ÎĲḬĲjlǉḬĲiiĳlJlĳljlĴĳJjÎǉｊÎｊĴｊ]
        ÎĲḬJiJiiḬĴḬĴĳiǉÎⅉĴJｊlÎJⅉｊÎÎĳĲĴ: int = ((42496921980733*((0*(~979)+-1*(620 ^ 979)+-1*(~(620 ^ 979))+1*(620 & ~979)+1*(~620 | 979))+(8994360928705567))+(18886076712358))%2**46)
        if ⅉIjⅉｊⅉĲḬIĴǉｊiｊĴIｊḬJJÎjlilĳlḬjĴ in self.varnames_map:
            ⅉIjⅉｊⅉĲḬIĴǉｊiｊĴIｊḬJJÎjlilĳlḬjĴ = self.varnames_map[ⅉIjⅉｊⅉĲḬIĴǉｊiｊĴIｊḬJJÎjlilĳlḬjĴ]
        jlｊijÎIǉjÎĳIǉllḬIⅉIĳjǉiǉllĳÎⅉǉ = ⅉIjⅉｊⅉĲḬIĴǉｊiｊĴIｊḬJJÎjlilĳlḬjĴ ** ÎĲḬĲjlǉḬĲiiĳlJlĳljlĴĳJjÎǉｊÎｊĴｊ
        lIǉĲIĴĳĴⅉJliIⅉĴlĲⅉǉlǉlÎlÎlĳḬĳĴ: int = ((8099*((0*(~(338 | 1000))+0*(~338 | 1000)+-1*(338 & 1000)+-1*(338 & ~1000)+1*(338))+(11955330))+(14939))%2**14)
        ÎⅉĳIjÎlḬIĳÎÎJĳĲIḬjJÎJJḬiĲｊĳlll: int = ((46895860566025903*((1*(660 ^ 795)+0*(660 & 795)+0*(660)+-1*(-1)+1*(~(660 ^ 795)))+(13073378702382110168515))+(4593217812451279362))%2**62)
        self.stack.append(jlｊijÎIǉjÎĳIǉllḬIⅉIĳjǉiǉllĳÎⅉǉ)

    def handle_binary_true_divide(self):
        IĲｊÎjlĲǉḬÎjⅉJIǉIjIｊǉĴlǉIjlĴｊÎḬ = self.stack.pop()
        ĴjⅉǉⅉḬlllⅉⅉĳḬĳⅉǉllĲIḬjｊĲĴⅉĴIｊi: int = ((51461115*((-1*(857 ^ 340)+1*(~(857 & 340))+1*(857 & ~340)+-1*(~340))+(91468609274))+(172523404))%2**28)
        ĲĲijǉĴⅉJĴǉIⅉｊĳǉĴĳiḬlĳiĳJḬjǉǉｊⅉ = self.stack.pop()
        if IĲｊÎjlĲǉḬÎjⅉJIǉIjIｊǉĴlǉIjlĴｊÎḬ in self.varnames_map:
            IĲｊÎjlĲǉḬÎjⅉJIǉIjIｊǉĴlǉIjlĴｊÎḬ = self.varnames_map[IĲｊÎjlĲǉḬÎjⅉJIǉIjIｊǉĴlǉIjlĴｊÎḬ]
        if ĲĲijǉĴⅉJĴǉIⅉｊĳǉĴĳiḬlĳiĳJḬjǉǉｊⅉ in self.varnames_map:
            ĲĲijǉĴⅉJĴǉIⅉｊĳǉĴĳiḬlĳiĳJḬjǉǉｊⅉ = self.varnames_map[ĲĲijǉĴⅉJĴǉIⅉｊĳǉĴĳiḬlĳiĳJḬjǉǉｊⅉ]
        ĴIJĲḬｊijJlĳǉjǉǉḬǉljĲIJĴÎｊJⅉｊII = ĲĲijǉĴⅉJĴǉIⅉｊĳǉĴĳiḬlĳiĳJḬjǉǉｊⅉ / IĲｊÎjlĲǉḬÎjⅉJIǉIjIｊǉĴlǉIjlĴｊÎḬ
        self.stack.append(ĴIJĲḬｊijJlĳǉjǉǉḬǉljĲIJĴÎｊJⅉｊII)

    # Unary operations 
    def handle_get_iter(self):
        self.stack[-((123*((-1*(439 ^ 279)+1*(439 | 279)+-1*(439)+1*(439 & ~279))+(408))+(505))%2**9)] = iter(self.stack[-((2107823506817*((-2*(~852)+1*(~(427 | 852))+1*(~(427 & 852))+-1*(852)+1*(427))+(13921062374735))+(4915061243954))%2**43)])
        ĴⅉĳlĳÎJlｊĴĲｊIÎｊiIIlḬｊĴĳḬIĳlÎĳJ: int = ((360372727299063*((0*(~(597 & 760))+1*(597 & ~760)+-1*(597 | ~760)+1*(~(597 ^ 760)))+(694967170661967598))+(70898724625975))%2**49)
        ĳǉĲĲiÎÎlǉIiｊⅉǉḬĳĳǉilｊḬǉⅉǉjǉĳⅉĲ: int = ((126368053659*((1*(~(745 | 820))+-1*(~820)+0*(-1)+0*(~745)+1*(745 & ~820))+(559316982319349))+(36010790940))%2**38)
        ḬjḬjｊJĲJiijǉｊlĳǉlIjÎḬḬĲǉlĲĳÎJⅉ: int = ((204021787003418511823404613*((-1*(~898 & 722)+1*(~(898 & 722))+-1*(~722)+0*(-1))+(24665776257357599735584611987))+(137110051010719672507411223))%2**88)

    def handle_unary_invert(self):
        IljIｊiｊḬｊĳÎǉĴIĳIｊｊlḬⅉĲlĳÎⅉĲĲĴi: int = ((28134628525309*((-1*(~(311 ^ 141))+1*(-1)+-1*(311 ^ 141)+0*(~(311 & 141)))+(144690008898524979))+(26578535026358))%2**46)
        ĲjǉĴĳｊIjĳIilǉiḬJｊljǉḬｊjⅉⅉJｊⅉǉI = self.stack.pop()
        if ĲjǉĴĳｊIjĳIilǉiḬJｊljǉḬｊjⅉⅉJｊⅉǉI in self.varnames_map:
            ĲjǉĴĳｊIjĳIilǉiḬJｊljǉḬｊjⅉⅉJｊⅉǉI = self.varnames_map[ĲjǉĴĳｊIjĳIilǉiḬJｊljǉḬｊjⅉⅉJｊⅉǉI]
        ｊｊJĳǉĳⅉĳiJiǉlⅉjĴⅉⅉlĳｊｊllĲjjJJⅉ: int = ((13156494423583320373*((0*(~798 & 966)+-1*(~798)+-1*(798 | ~966)+1*(~966)+1*(~798 | 966))+(522153323932574217717))+(2046045083450644444))%2**64)
        if self.debug:
            print(f"handle_unary_invert {ĲjǉĴĳｊIjĳIilǉiḬJｊljǉḬｊjⅉⅉJｊⅉǉI}")
        IjiIĳjiÎⅉilIIijǉlǉⅉĳĳⅉǉiĲjÎjJi: int = ((118142045056945*((-1*(916 | ~974)+-1*(916 ^ 974)+1*(916 & ~974)+1*(-1))+(1192443120448795336))+(71545949196630))%2**47)
        ǉĲÎĴḬｊĲĳIⅉｊĴĲJĳĳIĲĲlÎǉjjÎiJĳil = ~ĲjǉĴĳｊIjĳIilǉiḬJｊljǉḬｊjⅉⅉJｊⅉǉI
        ǉǉJĳIlĳiĲĳÎjJiｊjǉⅉlǉÎliǉiḬjÎjĴ: int = ((6351*((1*(781 ^ 96)+-1*(~(781 & 96))+1*(~(781 | 96))+0*(781 | 96))+(7005013))+(7628))%2**13)
        jJǉjjⅉlJIÎlｊĴiÎｊiǉǉÎilḬǉÎｊĲｊḬÎ: int = ((5029131379*((1*(800)+-2*(800 & ~278)+1*(~278)+-1*(~(800 ^ 278)))+(7768460443945))+(6056654931))%2**33)
        self.stack.append(ǉĲÎĴḬｊĲĳIⅉｊĴĲJĳĳIĲĲlÎǉjjÎiJĳil)

    # Data structures 
    def handle_build_list(self, jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ: int):
        ḬĴḬḬJlⅉIjĲjḬJǉḬĴiǉⅉḬjjⅉⅉĴｊlｊĳǉ: int = ((8783848388484166341*((-1*(~jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ | jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+0*(~jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+1*(-1)+-1*(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+1*(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ & jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ))+(43679389682815228343084))+(531184147150397578))%2**63)
        ljǉｊJĳĳǉJⅉĳｊⅉĲĳĳIĴJǉĴĳjⅉĳÎjǉjI = [self.stack.pop() for ĳｊIĲĲjĲÎJlḬIJĲiⅉĴĲⅉĲĳｊⅉJjilIIĴ in range(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)]
        JǉǉǉⅉⅉlIJｊⅉḬjJJḬlⅉIÎｊjJliiĲĴｊḬ: int = ((1039564560937*((-2*(~jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+0*(~jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+-1*(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+1*(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ | ~jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+1*(~(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ & jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)))+(1221696889300071))+(6385904517941))%2**43)
        ǉⅉĲǉⅉjjĲÎĴｊĲĲĴlⅉｊĲJⅉĴⅉIĲÎÎJÎÎl: int = ((3381428967*((-1*(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ | ~jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+1*(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+0*(~jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ & jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+1*(~(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ | jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)))+(4868304589009))+(3707605597))%2**32)
        self.stack.append(ljǉｊJĳĳǉJⅉĳｊⅉĲĳĳIĴJǉĴĳjⅉĳÎjǉjI)
        ĳĳⅉijĲlĴḬIｊIÎJĲjḬĲĲjlǉǉĲｊilJǉḬ: int = ((40913552212718174429385*((0*(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ & jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+-1*(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ | ~jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+0*(~(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ & jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ))+1*(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ & ~jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)+1*(~(jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ ^ jǉĳḬḬĳjliĴjḬÎｊÎĴIĳĳIlĳǉⅉlĴjｊⅉÎ)))+(124913108946779088131428292))+(57080229550037164799331))%2**77)

    # Logic
    def handle_compare_op(self, ĴⅉǉjĲÎIiiⅉIiJiÎÎĲĳĳJliḬjⅉÎIĲÎl: str):
        """
        Remove TOS and TOS1, calculate result and push back onto stack
        """
        jIｊĲlĴJĳⅉĴĴḬḬｊJⅉJｊJJｊjĲIIĴJĴḬḬ = self.stack.pop()
        ĴǉĴijĴjiǉĳｊĴJÎĲḬｊĲǉiIÎǉJjǉJIⅉJ = self.stack.pop()
        if jIｊĲlĴJĳⅉĴĴḬḬｊJⅉJｊJJｊjĲIIĴJĴḬḬ in self.varnames_map:
            jIｊĲlĴJĳⅉĴĴḬḬｊJⅉJｊJJｊjĲIIĴJĴḬḬ = self.varnames_map[jIｊĲlĴJĳⅉĴĴḬḬｊJⅉJｊJJｊjĲIIĴJĴḬḬ]
        lIJǉIilｊḬiｊIjⅉjJĴÎｊⅉĴḬIIJｊǉĲⅉj: int = ((2768864724121589395*((0*(~288)+2*(~624 & 288)+-1*(624 ^ 288)+-1*(~624 | 288)+1*(624 | ~288))+(1456981991779883594591))+(3179257342456715775))%2**62)
        if ĴǉĴijĴjiǉĳｊĴJÎĲḬｊĲǉiIÎǉJjǉJIⅉJ in self.varnames_map:
            ĴǉĴijĴjiǉĳｊĴJÎĲḬｊĲǉiIÎǉJjǉJIⅉJ = self.varnames_map[ĴǉĴijĴjiǉĳｊĴJÎĲḬｊĲǉiIÎǉJjǉJIⅉJ]
        ĴjÎliｊIĳǉⅉｊｊjiｊĲJĲḬｊⅉJｊĴｊĳĲĳｊJ: int = ((378070274392718860516921736131*((0*(~318 & 980)+1*(318 & 980)+1*(~(318 & 980))+-1*(-1))+(1395785554108897879744193887964319))+(191416311734371308056741909960))%2**99)
        lǉǉJIⅉÎJⅉⅉJiｊǉｊĲḬĳlⅉÎĲIjⅉｊIJⅉĴ = eval(f"{jIｊĲlĴJĳⅉĴĴḬḬｊJⅉJｊJJｊjĲIIĴJĴḬḬ} {dis.cmp_op[ĴⅉǉjĲÎIiiⅉIiJiÎÎĲĳĳJliḬjⅉÎIĲÎl]} {ĴǉĴijĴjiǉĳｊĴJÎĲḬｊĲǉiIÎǉJjǉJIⅉJ}")
        self.stack.append(lǉǉJIⅉÎJⅉⅉJiｊǉｊĲḬĳlⅉÎĲIjⅉｊIJⅉĴ)

    # Control flow and calling
    def handle_call_function(self, ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI: int):
        """
        Calls a callable object with positional arguments. argc indicates the number of positional arguments. 
        The top of the stack contains positional arguments, with the right-most argument on top. 
        Below the arguments is a callable object to call. 
        CALL_FUNCTION pops all arguments and the callable object off the stack, calls the callable object 
        with those arguments, and pushes the return value returned by the callable object
        """
        ĲｊĴÎlĲǉiJĴjḬḬliⅉĴｊIḬⅉĲĴĴllĲiǉｊ: int = ((746655275377632950645530585*((-1*(ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI & ~ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI)+0*(ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI)+-1*(~ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI & ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI)+1*(ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI ^ ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI)+0*(~(ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI ^ ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI)))+(3173613930843643815838020103746))+(693204039558220601199733493))%2**90)
        ｊIḬĲⅉÎĳJⅉĴǉｊIJĳĴĲÎⅉⅉlḬǉÎⅉĴĲｊĴi = [self.stack.pop() for jĲiJĲljǉÎjIｊjiĲljiⅉǉjĴIliǉjⅉjl in range(ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI)]
        ĲlIⅉJǉjḬḬĳḬĳĲⅉjIⅉjjliJĲÎjⅉｊIḬⅉ = []
        for jilḬJⅉǉjJJJlJjǉlǉjlⅉｊǉⅉIÎjĳḬiǉ in ｊIḬĲⅉÎĳJⅉĴǉｊIJĳĴĲÎⅉⅉlḬǉÎⅉĴĲｊĴi:
            if jilḬJⅉǉjJJJlJjǉlǉjlⅉｊǉⅉIÎjĳḬiǉ in self.varnames_map:
                ĲlIⅉJǉjḬḬĳḬĳĲⅉjIⅉjjliJĲÎjⅉｊIḬⅉ.append(self.varnames_map[jilḬJⅉǉjJJJlJjǉlǉjlⅉｊǉⅉIÎjĳḬiǉ])
            else:
                ĲlIⅉJǉjḬḬĳḬĳĲⅉjIⅉjjliJĲÎjⅉｊIḬⅉ.append(jilḬJⅉǉjJJJlJjǉlǉjlⅉｊǉⅉIÎjĳḬiǉ)
        ⅉḬĴⅉǉĳǉĳｊIjḬiĳIiｊĲiÎĴｊĳlｊｊḬlĲÎ = self.stack.pop()
        # We gotta reverse this
        ĲlIⅉJǉjḬḬĳḬĳĲⅉjIⅉjjliJĲÎjⅉｊIḬⅉ = ĲlIⅉJǉjḬḬĳḬĳĲⅉjIⅉjjliJĲÎjⅉｊIḬⅉ[::-((14464061643391*((1*(ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI & ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI)+1*(ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI & ~ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI)+1*(~(ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI | ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI))+-1*(ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI | ~ǉÎḬｊｊĴĳjǉⅉǉÎIÎⅉjｊḬḬĲIĴlĴlⅉIĳĴI))+(72119482074369))+(50029359671938))%2**46)]
        if self.debug:
            print(f"callable: {ⅉḬĴⅉǉĳǉĳｊIjḬiĳIiｊĲiÎĴｊĳlｊｊḬlĲÎ}")
            print(f"args: {ĲlIⅉJǉjḬḬĳḬĳĲⅉjIⅉjjliJĲÎjⅉｊIḬⅉ}")
        if ⅉḬĴⅉǉĳǉĳｊIjḬiĳIiｊĲiÎĴｊĳlｊｊḬlĲÎ in self.vm_globals:
            ǉÎjJlljḬIｊlĴǉｊJĲiliǉiiJJǉḬⅉJJḬ = self.vm_globals[ⅉḬĴⅉǉĳǉĳｊIjḬiĳIiｊĲiÎĴｊĳlｊｊḬlĲÎ](*ĲlIⅉJǉjḬḬĳḬĳĲⅉjIⅉjjliJĲÎjⅉｊIḬⅉ)
        elif ⅉḬĴⅉǉĳǉĳｊIjḬiĳIiｊĲiÎĴｊĳlｊｊḬlĲÎ in self.names:
            ǉÎjJlljḬIｊlĴǉｊJĲiliǉiiJJǉḬⅉJJḬ = getattr(self.vm_globals["__builtins__"], ⅉḬĴⅉǉĳǉĳｊIjḬiĳIiｊĲiÎĴｊĳlｊｊḬlĲÎ)(*ĲlIⅉJǉjḬḬĳḬĳĲⅉjIⅉjjliJĲÎjⅉｊIḬⅉ)
        self.stack.append(ǉÎjJlljḬIｊlĴǉｊJĲiliǉiiJJǉḬⅉJJḬ)

    def handle_load_method(self, ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ: int):
        IIiJⅉḬｊḬĲiJĳĲlĳiĳⅉÎĴĳĲIⅉⅉǉⅉĳIÎ: int = ((1518232859616155*((-1*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ | ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ | ~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+0*(-1)+-1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+(15819995914614505198))+(1059734850615786))%2**51)
        lĲⅉḬｊjlｊjjllĴiｊiIĴlⅉiĳJÎIÎḬｊĲl = self.stack.pop()
        ⅉĴĲĲjǉǉĲⅉIÎiIJⅉｊĳÎiｊliIĴjĳĳĴǉi: int = ((33001*((-1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ | ~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+0*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ | ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+0*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+1*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ ^ ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)))+(143517942))+(4388))%2**18)
        jJḬḬJĲĴiilJｊIĳIJĲḬiJǉJĲllĲĳjḬl: int = ((76204750594894055053661*((0*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ ^ ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+-1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+(714633478480189783530270105))+(331100320647024824246478))%2**79)
        jｊĴḬĳǉiǉlⅉJÎJIｊḬĲĴjǉiÎĲĳⅉｊÎÎǉI: int = ((39479160081815*((0*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ | ~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+-1*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+1*(~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+(393862146697011340))+(120006705073391))%2**47)
        ⅉijĴǉḬlĳlḬⅉⅉJǉjｊḬḬĳÎǉｊĴJJĲÎjiⅉ: int = ((3456251101*((0*(-1)+-1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ | ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+(9167677187574))+(16239428781))%2**35)
        lⅉĴIĲｊIǉḬĲｊĳḬĳⅉｊⅉĳⅉｊjǉĳḬjĳljiJ: int = ((521289840365568137420827*((-1*(~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ | ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ ^ ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+1*(~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+0*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+(10424594298946810721384098914))+(132802511910414968420400))%2**80)
        IĴĴĳⅉljIIijḬlIĲJÎÎǉIiJｊjiḬjḬⅉÎ: int = ((138048890604118480948119385659*((1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+-1*(~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ ^ ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+-1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+(789124650252558999026999210563292))+(129505027729559040418108385967))%2**97)
        ĳjｊĴĳⅉIIIiⅉⅉǉⅉJĲḬĴĴḬliÎjÎｊiÎǉJ: int = ((19604068385093830823*((-1*(~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+-1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ ^ ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+-1*(~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)))+(393511252426623962152651))+(73171264536287037438))%2**66)
        ǉĲĳｊIIḬÎĴiḬǉĳǉiḬllḬĳJǉｊJiĴĲǉĴⅉ: int = ((94800906332743165076387*((0*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ ^ ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+0*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ | ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+-1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ | ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+(1254691041518326963691537948))+(291130122066238016823467))%2**78)
        iｊlÎjĲJĴjJIjǉｊǉĳlḬǉｊJｊĳlÎĲĴÎiĴ: int = ((11872827*((-1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ | ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+2*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+-1*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ ^ ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+0*(~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(~(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)))+(247866455746))+(80895013))%2**27)
        if lĲⅉḬｊjlｊjjllĴiｊiIĴlⅉiĳJÎIÎḬｊĲl in self.varnames_map:
            lĲⅉḬｊjlｊjjllĴiｊiIĴlⅉiĳJÎIÎḬｊĲl = self.varnames_map[lĲⅉḬｊjlｊjjllĴiｊiIĴlⅉiĳJÎIÎḬｊĲl]
        IⅉIｊĲiｊĳIⅉǉⅉĴⅉḬIjⅉǉĲlĲIǉÎⅉĴⅉｊI: int = ((12839807454109*((0*(~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+-1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+-1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ ^ ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ | ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+(37687891031594048))+(10453792419886))%2**44)
        self.stack.append(getattr(lĲⅉḬｊjlｊjjllĴiｊiIĴlⅉiĳJÎIÎḬｊĲl, self.names[ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ]))
        self.stack.append(lĲⅉḬｊjlｊjjllĴiｊiIĴlⅉiĳJÎIÎḬｊĲl)
        ĳĴIĳiIĴÎĴĴǉÎJĲｊĴḬĳJḬÎlljⅉIǉĳĳĳ: int = ((16094677237602314779470205025*((-1*(~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+-1*(ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ)+1*(-1)+0*(~ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ & ｊｊiｊÎIijÎjiｊJḬĲÎǉlĴjlÎｊIｊǉIǉĴJ))+(77488853167867560292110590203126))+(4195801443358981929852598438))%2**95)

    def handle_call_method(self, ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl: int):
        ǉⅉḬĳjĳⅉĳiḬlÎｊĴjIⅉｊĲḬⅉlǉlJĲiliｊ: int = ((343673265390122377481207745*((-1*(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl & ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl)+-1*(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl ^ ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl)+0*(~ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl)+0*(~(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl ^ ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl))+1*(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl | ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl))+(7687475378284240230190054605262))+(1411391131213636198924455827))%2**91)
        ḬĲǉǉÎｊǉÎǉĲĴｊĳlĴǉｊlÎIĲIⅉIÎĴｊｊĴi = [self.stack.pop() for ÎÎjJĲiⅉĳlÎḬilJijiｊḬiÎÎḬǉijⅉlli in range(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl)]
        IJÎｊｊḬĴǉｊǉｊⅉⅉlḬⅉlJǉĳⅉÎljJÎjJｊi = []
        for ĴjĴiĴĴĴǉḬIĳĳijḬǉjÎĲḬJĴlĳĴiⅉlｊḬ in ḬĲǉǉÎｊǉÎǉĲĴｊĳlĴǉｊlÎIĲIⅉIÎĴｊｊĴi:
            if ĴjĴiĴĴĴǉḬIĳĳijḬǉjÎĲḬJĴlĳĴiⅉlｊḬ in self.varnames_map:
                IJÎｊｊḬĴǉｊǉｊⅉⅉlḬⅉlJǉĳⅉÎljJÎjJｊi.append(self.varnames_map[ĴjĴiĴĴĴǉḬIĳĳijḬǉjÎĲḬJĴlĳĴiⅉlｊḬ])
            else:
                IJÎｊｊḬĴǉｊǉｊⅉⅉlḬⅉlJǉĳⅉÎljJÎjJｊi.append(ĴjĴiĴĴĴǉḬIĳĳijḬǉjÎĲḬJĴlĳĴiⅉlｊḬ)
        ḬĳlĲḬǉiĳJĳlJｊĴĲiIǉÎĳǉJJⅉJĴḬIĳｊ = self.stack.pop()
        lÎjĳĴĳjIlḬliiĳiⅉｊĲǉÎĲlǉÎⅉjǉĳḬJ: int = ((564112776596575880813469008337*((0*(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl | ~ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl)+-1*(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl & ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl)+-1*(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl & ~ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl)+1*(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl)+0*(~ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl))+(928039426308900286917806211661988))+(24966878518712210024809229600))%2**99)
        ǉĲJǉĲlIǉⅉIjiĳIĳǉJĳĳJlÎḬｊｊĴiIji = self.stack.pop()
        if self.debug:
            print(f"obj: {ḬĳlĲḬǉiĳJĳlJｊĴĲiIǉÎĳǉJJⅉJĴḬIĳｊ} method: {ǉĲJǉĲlIǉⅉIjiĳIĳǉJĳĳJlÎḬｊｊĴiIji}")
        JjiĳĳiǉilJⅉjǉĳｊljĲlĲḬｊḬǉḬḬlĲｊĲ: int = ((675975415439790895115*((-1*(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl & ~ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl)+-1*(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl & ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl)+-1*(~(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl | ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl))+0*(~(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl & ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl))+1*(ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl | ~ⅉǉJḬÎｊｊiiIĴjĴlIｊiJĴiÎĳĳiǉǉĲlÎl))+(189937456403982807079558))+(677982563761056333344))%2**70)
        IｊlǉliｊÎｊḬÎǉǉÎÎljJlÎÎIḬlĴjⅉⅉĴi = getattr(ḬĳlĲḬǉiĳJĳlJｊĴĲiIǉÎĳǉJJⅉJĴḬIĳｊ, ǉĲJǉĲlIǉⅉIjiĳIĳǉJĳĳJlÎḬｊｊĴiIji.__name__)(*IJÎｊｊḬĴǉｊǉｊⅉⅉlḬⅉlJǉĳⅉÎljJÎjJｊi)
        self.stack.append(IｊlǉliｊÎｊḬÎǉǉÎÎljJlÎÎIḬlĴjⅉⅉĴi)

    def handle_format_value(self, ḬḬjｊJjⅉḬIÎjIjǉⅉĳjⅉlḬJÎĴlǉǉĳiĴI):
        ĲiÎiḬǉḬǉｊÎIḬĴĳĳⅉIǉｊｊḬǉllijⅉḬĳĴ: int = ((5676703525881932961671162635*((1*(~(806 ^ 678))+0*(806 | 678)+-1*(~(806 | 678))+-1*(806 & 678))+(27869113697995797865740055501135))+(2562577669750381134661285657))%2**93)
        ǉĴjｊǉJĴlJĳḬｊĴĲĴÎIĴⅉⅉḬiĳiĴĳⅉJlǉ: int = ((185007165064645*((1*(572 & 524)+0*(~572)+-1*(524)+1*(~572 & 524))+(575678866960121219))+(148528164020390))%2**50)
        ĲｊlĴǉijĴIiiÎjlÎǉĲiJｊJJlĴĴIjǉḬĳ: int = ((515466909911828779839197078019*((-3*(~687 | 339)+2*(~(687 ^ 339))+2*(~687)+-1*(~339)+1*(687 | 339))+(4269622536043226006577306840405708))+(263547845064866807003927856002))%2**99)
        ǉǉlIIIĲÎĳĳḬḬｊĴｊÎÎⅉｊJlĲjǉjÎĳĴḬI: int = ((856920960081357721693086060775*((0*(~(967 ^ 532))+-1*(~(967 & 532))+1*(~967 & 532)+1*(~532))+(5070529801418218346060758180418724))+(1242800971487029779936010238797))%2**100)
        """
        Used for implementing formatted literal strings (f-strings).
        Pops an optional fmt_spec from the stack, then a required value. flags is interpreted as follows:
        (flags & 0x03) == 0x00: value is formatted as-is.
        (flags & 0x03) == 0x01: call str() on value before formatting it.
        (flags & 0x03) == 0x02: call repr() on value before formatting it.
        (flags & 0x03) == 0x03: call ascii() on value before formatting it.
        (flags & 0x04) == 0x04: pop fmt_spec from the stack and use it, else use an empty fmt_spec.
        Formatting is performed using PyObject_Format(). The result is pushed on the stack.
        """
        pass
        iiⅉｊǉⅉĲĲⅉḬḬⅉjⅉjjÎÎḬĳJĲĳǉḬlⅉJｊĴ: int = ((6507204774422696195*((-1*(~346)+1*(-1)+-1*(346)+0*(537 & 346)+0*(~537))+(19395147725916024078167))+(14576526879617056714))%2**64)
        lⅉĴÎǉiĳǉⅉJĲĲIｊÎlĳlĳĳĳⅉIIiĳĲĳǉｊ: int = ((8996779*((-2*(~188 & 424)+1*(~188)+-1*(~(188 ^ 424))+1*(424))+(100176838467))+(12862454))%2**24)
    
    def handle_extended_arg(self, ⅉĳiĲĳiIĴÎIĲĳÎĳḬⅉjÎlｊjĳjḬÎiIijⅉ):
        ḬjĳǉiĴÎⅉIĴǉlⅉIĳｊĲĳÎĴJÎḬiĳlĳÎⅉĴ: int = ((132094288060160391358669*((-1*(682)+0*(573)+1*(682 & 573)+0*(682 | ~573)+1*(682 & ~573))+(185780066909533118520577140))+(74424085190162000620684))%2**78)
        ḬĴḬĲḬḬjⅉJｊｊJǉĴiǉǉjǉĴĲĴḬIJǉÎǉḬÎ: int = ((53077991*((1*(~644 & 952)+1*(644 | ~952)+-1*(644 & ~952)+-1*(~644 | 952))+(10380348093525))+(234547217))%2**31)
        IÎⅉĴiⅉḬIjijḬÎḬⅉÎḬǉĲĳJĴIḬlĲjｊǉⅉ: int = ((8193535532059349192175664717*((1*(890 ^ 355)+-2*(890 & ~355)+-1*(355)+0*(890 | ~355)+1*(890))+(70174671318196433889818087082563))+(32928621069069259791169385486))%2**96)
        ĲjĴｊIｊIIⅉlĴÎǉJIĳiiｊJĴlǉĳÎⅉJJｊi: int = ((7586587797*((1*(~(151 ^ 961))+-1*(-1)+1*(151 | 961)+-1*(151 & 961))+(21882264721285))+(4345182777))%2**33)
        ĲⅉjĲÎĴĳlĲḬⅉJIｊⅉḬIJĳiIḬｊǉIIIｊĲi: int = ((255447591734435081*((-3*(747 | ~707)+3*(~(747 ^ 707))+1*(~707)+-1*(~(747 | 707))+2*(747 & ~707))+(67024875198299413472))+(120917203427272663))%2**59)
        ǉĲｊÎÎｊｊÎĳlｊĳḬｊĴĴĳĴljJǉÎJjlĲĲｊl: int = ((126846760827447*((1*(857)+2*(~857 & 71)+-2*(-1)+1*(~71)+1*(~(857 ^ 71)))+(432127816485995492))+(236784814268595))%2**48)
        ǉǉjliｊⅉJⅉⅉlĴÎǉǉIJlḬÎǉJÎĳÎÎljĴJ: int = ((2811087*((-1*(~(312 & 11))+0*(~(312 | 11))+-1*(312 & 11)+1*(-1))+(1541180697))+(15050080))%2**24)
        ĳÎĳIjĳⅉĳIJⅉlĴÎĳĳǉĲiiĳÎḬḬḬⅉlÎĴⅉ: int = ((7283603*((-1*(~451)+1*(~(251 ^ 451))+-1*(251)+-2*(~251)+2*(~(251 & 451)))+(51950092263))+(29103726))%2**25)
        ĴIｊiiĴĴĳĴĲjIǉiIĳiJÎJjiiIiJĳili: int = ((9188019470942068242595*((-1*(539 | ~484)+-2*(484)+-2*(~539)+3*(~539 | 484)+1*(539 ^ 484))+(28780813648106288932400102))+(1627406936118728939810))%2**73)
        pass
        ĳIjｊIǉjjĳÎĲĲĲlIjÎĳIĲⅉḬĳⅉĳljⅉĲĲ: int = ((523472187524677979291*((0*(~131 & 659)+-1*(131 & 659)+1*(-1)+-1*(~(131 & 659)))+(9305146591015712413966456))+(578983715415052227007))%2**71)

    def handle_return_value(self):
        jJJĲｊĲḬⅉｊǉⅉḬḬjÎJĳｊǉĳĲJĳǉjḬÎIĴｊ: int = ((6854386343734161434020915*((-1*(~(554 ^ 121))+1*(554 | ~121)+0*(~(554 & 121))+-1*(554 & ~121))+(4850094938754022754201430080))+(5875019888933968881565473))%2**83)
        iḬJjⅉǉｊjḬIÎlĳĴĴIⅉḬⅉiḬĲⅉⅉiĳⅉĳǉⅉ: int = ((57894857284444357899*((-1*(~643)+2*(~(742 ^ 643))+-1*(742 | 643)+-1*(~742 | 643)+2*(742 ^ 643))+(76962611168784075837280))+(43040574466835562527))%2**66)
        JJⅉiǉĳⅉÎĴⅉĴJiⅉllĲJḬｊĲⅉJjIIJĲⅉI: int = ((4267306414451598241121*((1*(~628 | 332)+-5*(628)+5*(628 & ~332)+-1*(~628)+4*(628 & 332))+(111049912715141730487746290))+(3491831938991651435564))%2**74)
        ÎiJlⅉｊIⅉlĲḬḬĲｊĲiǉjｊĳḬÎIĲjｊｊｊjⅉ: int = ((1321780435149419887583*((-1*(886 | 811)+-1*(~886 & 811)+1*(811)+-1*(~(886 | 811))+1*(~(886 & 811)))+(4604378933473730530623956))+(1330112330576067322570))%2**71)
        IĴÎĴĴJJĴÎｊĲǉḬｊiIĳĴJｊlÎiⅉⅉⅉiĴiJ: int = ((1752718604187*((1*(~(447 | 129))+0*(~447 & 129)+1*(129)+-1*(~447 | 129))+(76547955287509365))+(873884206714))%2**43)
        lÎiǉIⅉǉJlĴiiĴĲĲｊĳĴlĲｊｊjiJĳĴlÎJ: int = ((357911*((1*(~(269 & 257))+-2*(~(269 | 257))+-1*(269 | 257)+1*(~(269 ^ 257)))+(497344438))+(269524))%2**19)
        ĴｊḬJlⅉIJIĴÎlḬjĲⅉｊIǉjiｊḬjÎIÎḬĴⅉ: int = ((55271074504573*((-1*(190)+1*(190 & 693)+-1*(~190 & 693)+0*(190 | ~693)+1*(190 ^ 693))+(729595698427786999))+(120441063249700))%2**47)
        jĳｊIĳiｊĲJⅉǉÎÎｊĴĴǉIiĴĴǉⅉJḬÎｊJĴJ: int = ((20464087*((1*(~(543 | 969))+0*(543 | 969)+-1*(543 | ~969)+1*(543))+(2135416058))+(47847065))%2**26)
        ĴIIĲIⅉIlⅉⅉĲǉĳĲĲⅉǉĴiǉlJilĴǉĳĳⅉĳ: int = ((15753457058309*((-1*(937 & ~697)+1*(-1)+0*(937)+-1*(~937 | 697))+(13603671493856622))+(15011072976378))%2**45)
        ĴǉIⅉĴǉĴḬḬǉÎĴǉijjĴĲJJiĳⅉIJĳⅉĴḬÎ = self.stack.pop()
        ⅉｊÎĲjJJｊǉIlḬĳǉｊJlǉjJĴlIiｊJĴǉｊĲ: int = ((20050192773656040184951656377*((-1*(971 & 788)+0*(971 & ~788)+-1*(~(971 | 788))+1*(~(971 ^ 788)))+(64962695709626767933262841628459))+(11556147540347151010217809144))%2**96)
        self.exit(ĴǉIⅉĴǉĴḬḬǉÎĴǉijjĴĲJJiĳⅉIJĳⅉĴḬÎ)
        ḬÎｊｊjĳĴĳĳJiｊĲlĲijⅉĳĴḬlJĲĳiJJĲl: int = ((26027674738451535*((1*(~(75 | 391))+-1*(-1)+0*(~(75 & 391))+1*(75 | 391))+(395870017257289384531))+(10452121245021216))%2**56)
        ｊjlḬⅉIǉjǉIḬJⅉÎĲｊJḬḬǉḬjIǉǉÎⅉḬĴｊ: int = ((725594281314716027*((-1*(908 & ~816)+-1*(~908 | 816)+1*(~(908 | 816))+0*(~908 & 816)+1*(908 | 816))+(147406201480944001261))+(728893872514916064))%2**60)

    def handle_for_iter(self, IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ: int):
        ÎĲĴjⅉǉĴIÎiJjĳiĴĳlḬｊIĴJIĴǉĳjJiｊ: int = ((1131867*((0*(~IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ & IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ)+1*(~(IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ | IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ))+-1*(~(IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ ^ IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ))+1*(IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ & IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ))+(7954356571))+(216018))%2**21)
        ĴĴĴḬⅉJJIjIĳĴÎⅉĲJlJjḬiĳJĴǉⅉJiiⅉ: int = ((1051233*((1*(IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ | IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ)+-1*(IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ)+-1*(IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ & ~IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ)+0*(IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ))+(10760304877))+(2374919))%2**22)
        lｊĲｊĴlĳĴḬḬljｊJĳĴliÎǉｊｊIĳĲĳjｊⅉĳ: int = ((2588821*((1*(~IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ)+-1*(IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ | ~IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ)+1*(~(IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ ^ IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ))+-1*(~(IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ | IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ)))+(12382682362))+(3083815))%2**22)
        #BUG: delta is broken 
        try:
            ⅉḬḬｊjĲĲⅉIjⅉÎḬĲĳĳǉjḬⅉĴⅉÎｊḬⅉjⅉJJ = next(self.stack[-((2863231*((-2*(~IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ & IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ)+-2*(~(IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ | IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ))+-3*(IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ & IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ)+-1*(~IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ)+3*(~IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ | IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ))+(3110985))+(8266698))%2**23)])
            self.stack.append(ⅉḬḬｊjĲĲⅉIjⅉÎḬĲĳĳǉjḬⅉĴⅉÎｊḬⅉjⅉJJ)
        except StopIteration:
            self.stack.pop()
            self.idx += IÎIǉilĲĲĲĴlĳḬJḬiJｊjĴJlÎJĲḬĴĲÎǉ
    def handle_pop_jump_if_false(self, ｊjIĳJĲĲĴⅉⅉIIlIｊĲḬJÎiJḬḬⅉḬĲĴjĴǉ):
        lĴǉjIĳlĴJiiĴḬⅉIｊĴḬḬlḬiｊJIlｊJIl = self.stack.pop()
        if lĴǉjIĳlĴJiiĴḬⅉIｊĴḬḬlḬiｊJIlｊJIl is False:
            self.idx = ｊjIĳJĲĲĴⅉⅉIIlIｊĲḬJÎiJḬḬⅉḬĲĴjĴǉ
        ĳĴĳǉĳĳⅉḬIǉlJIliljÎIjǉｊǉǉｊḬǉĳｊĳ: int = ((1485768962476287*((-1*(~(546 | 445))+1*(~445)+-1*(546 & ~445)+0*(546 | 445))+(8678634101805044972))+(16075330082704997))%2**55)

    def handle_jump_absolute(self, ⅉiJlÎJⅉĳiｊlĴⅉJⅉÎIⅉJlḬlⅉÎlĴḬiIĲ):
        ḬǉÎḬjlⅉĳjｊĳｊĴjIǉjĴǉiǉĳÎÎiljliḬ: int = ((1150451999969658036135409*((1*(126 & 188)+0*(~126 & 188)+1*(~(126 | 188))+-1*(-1)+1*(126 ^ 188))+(4493702211405669093113285702))+(886500601173955073943894))%2**80)
        ǉĴiJÎlḬlIjIĴiiJĴĴĲlⅉÎĳⅉJJĳlIḬl: int = ((135744506885*((-1*(866)+1*(706 | ~866)+2*(~706 & 866)+-1*(~(706 & 866)))+(3261387064739523))+(2117591145182))%2**41)
        JǉĴĲjǉÎiIĳĳjĴĴJĲḬIlĳⅉJjĴÎⅉjjĲĳ: int = ((43412024649075098227418454239*((1*(~563 & 381)+-1*(563 & ~381)+-1*(~563 | 381)+1*(563 | ~381))+(293249803317854415501421741739489))+(115434114745541577280818452304))%2**98)
        ÎiĴlĲJĲĴⅉĳIiḬĲJJĴJⅉijJĲÎjǉĳili: int = ((7325395817*((-1*(~370 & 507)+0*(~(370 & 507))+-1*(370 | ~507)+0*(370 & ~507)+1*(-1))+(462921991666257))+(59422606494))%2**38)
        ĲÎĴIJljjĴJjliJḬĲjjiIÎÎĴĴｊiĲⅉJl: int = ((3968854575295057*((0*(~936)+-1*(936 | ~97)+1*(~(936 ^ 97))+1*(936 & ~97))+(18048270095100160423))+(7121380357010891))%2**54)
        self.idx = ⅉiJlÎJⅉĳiｊlĴⅉJⅉÎIⅉJlḬlⅉÎlĴḬiIĲ    
        jjÎÎIⅉｊÎJⅉiĴｊĳĴǉlḬⅉiǉǉĴIllĲJⅉｊ: int = ((10000506007*((-1*(~398 & 987)+-1*(398 & 987)+1*(-1)+-1*(~987))+(13110175347365))+(9963480103))%2**34)
        lḬḬⅉIｊĳjǉjǉǉⅉĳĳǉⅉiⅉĴiiJjlǉJĴJｊ: int = ((21026899127406618018573*((-1*(962)+0*(~962)+-1*(305 & ~962)+1*(305 | 962))+(64851335552584797407790301))+(82197670493456564058190))%2**78)
class VirtualMachine:
    def __init__(
        self,
        opname_map,
        vm_globals,
        vm_locals,
        names,
        consts,
        varnames,
        bytecode
    ):
        """
        Our VM entry
        """
        self.stack = [] 
        self.opname_map = opname_map
        self.vm_globals = vm_globals
        self.vm_locals = vm_locals
        self.names = names
        self.consts = consts
        self.varnames = varnames
        self.varnames_map = {var: None for var in self.varnames}
        self.bytecode = bytecode
        self.idx = 0
        self.cont = True
        self.ret = None
        self.debug = True
        for local_name, local_val in vm_locals.items():
            if local_name in self.varnames_map:
                self.varnames_map[local_name] = local_val
        #HACK: there's definitely a smarter way to do this
        for global_name, global_val in vm_globals.items():
            self.varnames_map[global_name] = global_val
        if self.debug:
            print(f"stack: {self.stack}")
            print(f"vm_globals: {self.vm_globals}")
            print(f"vm_locals: {self.vm_locals}")
            print(f"names: {self.names}")
            print(f"consts: {self.consts}")
            print(f"varnames: {self.varnames}")
            print(f"varnames_map: {self.varnames_map}")
    
    def run(self):
        while self.cont is True:
            if self.debug:
                print("="*20)
                print(f"stack: {self.stack}")
                print(f"vm_globals: {self.vm_globals}")
                print(f"vm_locals: {self.vm_locals}")
                print(f"names: {self.names}")
                print(f"consts: {self.consts}")
                print(f"varnames: {self.varnames}")
                print(f"varnames_map: {self.varnames_map}")
            opcode = self.bytecode[self.idx]
            arg = self.bytecode[self.idx+1]
            # Just using opcode map for now, we can hide this later 
            py_opname = self.opname_map[str(opcode)]
            handler_name = f"handle_{py_opname.lower()}"              
            if self.debug:
                print(f"jarg_opcode: {opcode} jarg_arg: {arg}")
                print(f"py_opname: {py_opname}")
                print(f"handler_name: {handler_name}")
            if arg == 1337:
                getattr(self, handler_name)()
            else:
                # we have an argument
                getattr(self, handler_name)(arg)
            if self.debug:
                print("="*20)
            self.idx += 2
        return self.ret 
    
    def exit(self, val):
        self.cont = False
        self.ret = val


    # Handlers

    # General 
    def handle_pop_top(self):
        self.stack.pop()

    # Loading
    def handle_load_fast(self, var_num: int):
        """
        Pushes a reference to the local co_varnames[var_num] onto the stack
        """
        self.stack.append(self.varnames[var_num])
    
    def handle_load_const(self, consti: int):
        """
        Pushes co_consts[consti] onto the stack.
        """
        self.stack.append(self.consts[consti])
    
    def handle_load_global(self, namei: int):
        """
        Loads the global named co_names[namei] onto the stack
        """
        self.stack.append(self.names[namei])

    def handle_setup_finally(self, delta: int):
        """
        Pushes a try block from a try-finally or try-except clause onto the block stack. 
        delta points to the finally block or the first except block.
        """

    # Storing
    def handle_store_fast(self, var_num: int):
        """
        Stores TOS into the local co_varnames[var_num]  
        """
        varname = self.varnames[var_num]
        self.varnames_map[varname] = self.stack.pop()

    # Binary ops
    def handle_binary_or(self):
        x = self.stack.pop()
        y = self.stack.pop()
        if x in self.varnames_map:
            x = self.varnames_map[x]
        if y in self.varnames_map:
            y = self.varnames_map[y]
        if self.debug:
            print(f"handle_binary_or {x} {y}")
        res = y | x
        self.stack.append(res)

    def handle_binary_and(self):
        x = self.stack.pop()
        y = self.stack.pop()
        if x in self.varnames_map:
            x = self.varnames_map[x]
        if y in self.varnames_map:
            y = self.varnames_map[y]
        if self.debug:
            print(f"handle_binary_and {x} {y}")
        res = y & x
        self.stack.append(res)
        
    def handle_binary_xor(self):
        x = self.stack.pop()
        y = self.stack.pop()
        if x in self.varnames_map:
            x = self.varnames_map[x]
        if y in self.varnames_map:
            y = self.varnames_map[y]
        if self.debug:
            print(f"handle_binary_xor {x} {y}")
        res = y ^ x
        self.stack.append(res)

    def handle_binary_add(self):
        x = self.stack.pop()
        y = self.stack.pop()
        if x in self.varnames_map:
            x = self.varnames_map[x]
        if y in self.varnames_map:
            y = self.varnames_map[y]
        if self.debug:
            print(f"handle_binary_add {x} {y}")
        res = x + y
        self.stack.append(res)
    
    def handle_binary_subtract(self):
        x = self.stack.pop()
        y = self.stack.pop()
        if x in self.varnames_map:
            x = self.varnames_map[x]
        if y in self.varnames_map:
            y = self.varnames_map[y]
        if self.debug:
            print(f"handle_binary_subtract {x} {y}")
        res = y - x
        self.stack.append(res)
    
    def handle_binary_multiply(self):
        x = self.stack.pop()
        y = self.stack.pop()
        if x in self.varnames_map:
            x = self.varnames_map[x]
        if y in self.varnames_map:
            y = self.varnames_map[y]
        if self.debug:
            print(f"handle_binary_multiply {x} {y}")
        res = x * y
        self.stack.append(res)
    
    def handle_binary_modulo(self):
        x = self.stack.pop()
        y = self.stack.pop()
        if x in self.varnames_map:
            x = self.varnames_map[x]
        if y in self.varnames_map:
            y = self.varnames_map[y]
        res = y % x
        self.stack.append(res)

    def handle_binary_power(self):
        x = self.stack.pop()
        y = self.stack.pop()
        if x in self.varnames_map:
            x = self.varnames_map[x]
        if y in self.varnames_map:
            y = self.varnames_map[y]
        res = y ** x
        self.stack.append(res)

    def handle_binary_true_divide(self):
        x = self.stack.pop()
        y = self.stack.pop()
        if x in self.varnames_map:
            x = self.varnames_map[x]
        if y in self.varnames_map:
            y = self.varnames_map[y]
        res = y / x
        self.stack.append(res)

    # Unary operations 
    def handle_get_iter(self):
        self.stack[-1] = iter(self.stack[-1])

    def handle_unary_invert(self):
        x = self.stack.pop()
        if x in self.varnames_map:
            x = self.varnames_map[x]
        if self.debug:
            print(f"handle_unary_invert {x}")
        res = ~x
        self.stack.append(res)

    # Data structures 
    def handle_build_list(self, count: int):
        list = [self.stack.pop() for i in range(count)]
        self.stack.append(list)

    # Logic
    def handle_compare_op(self, opname: str):
        """
        Remove TOS and TOS1, calculate result and push back onto stack
        """
        x = self.stack.pop()
        y = self.stack.pop()
        if x in self.varnames_map:
            x = self.varnames_map[x]
        if y in self.varnames_map:
            y = self.varnames_map[y]
        res = eval(f"{x} {dis.cmp_op[opname]} {y}")
        self.stack.append(res)

    # Control flow and calling
    def handle_call_function(self, argc: int):
        """
        Calls a callable object with positional arguments. argc indicates the number of positional arguments. 
        The top of the stack contains positional arguments, with the right-most argument on top. 
        Below the arguments is a callable object to call. 
        CALL_FUNCTION pops all arguments and the callable object off the stack, calls the callable object 
        with those arguments, and pushes the return value returned by the callable object
        """
        args = [self.stack.pop() for i in range(argc)]
        args_final = []
        for arg in args:
            if arg in self.varnames_map:
                args_final.append(self.varnames_map[arg])
            else:
                args_final.append(arg)
        callable = self.stack.pop()
        # We gotta reverse this
        args_final = args_final[::-1]
        if self.debug:
            print(f"callable: {callable}")
            print(f"args: {args_final}")
        if callable in self.vm_globals:
            ret = self.vm_globals[callable](*args_final)
        elif callable in self.names:
            ret = getattr(self.vm_globals["__builtins__"], callable)(*args_final)
        self.stack.append(ret)

    def handle_load_method(self, namei: int):
        tos = self.stack.pop()
        if tos in self.varnames_map:
            tos = self.varnames_map[tos]
        self.stack.append(getattr(tos, self.names[namei]))
        self.stack.append(tos)

    def handle_call_method(self, argc: int):
        args = [self.stack.pop() for i in range(argc)]
        args_final = []
        for arg in args:
            if arg in self.varnames_map:
                args_final.append(self.varnames_map[arg])
            else:
                args_final.append(arg)
        obj = self.stack.pop()
        method = self.stack.pop()
        if self.debug:
            print(f"obj: {obj} method: {method}")
        ret = getattr(obj, method.__name__)(*args_final)
        self.stack.append(ret)

    def handle_format_value(self, flags):
        """
        Used for implementing formatted literal strings (f-strings).
        Pops an optional fmt_spec from the stack, then a required value. flags is interpreted as follows:
        (flags & 0x03) == 0x00: value is formatted as-is.
        (flags & 0x03) == 0x01: call str() on value before formatting it.
        (flags & 0x03) == 0x02: call repr() on value before formatting it.
        (flags & 0x03) == 0x03: call ascii() on value before formatting it.
        (flags & 0x04) == 0x04: pop fmt_spec from the stack and use it, else use an empty fmt_spec.
        Formatting is performed using PyObject_Format(). The result is pushed on the stack.
        """
        pass
    
    def handle_extended_arg(self, ext):
        pass

    def handle_return_value(self):
        tos = self.stack.pop()
        self.exit(tos)

    def handle_for_iter(self, delta: int):
        #BUG: delta is broken 
        try:
            val = next(self.stack[-1])
            self.stack.append(val)
        except StopIteration:
            self.stack.pop()
            self.idx += delta
        
    def handle_pop_jump_if_false(self, target):
        tos = self.stack.pop()
        if tos is False:
            self.idx = target

    def handle_jump_absolute(self, target):
        self.idx = target    